PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
/*!
    \file    gd32f3x0_hal_timer.c
    \brief   TIMER driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/* DMA callback function */
/* DMA transmission complete(TC) callback for TIMER update DMA request */
static void _update_dma_full_transfer_complete(void *dma);
/* DMA transmission complete(TC) callback for TIMER channel input capture DMA request */
static void _channelx_capture_dma_full_transfer_complete(void *dma);
/* DMA transmission complete(TC) callback for TIMER compare and pwm DMA request */
static void _channelx_compare_dma_full_transfer_complete(void *dma);
/* DMA transmission complete(TC) callback for TIMER commutation DMA request */
static void _commutation_dma_full_transfer_complete(void *dma);
/* DMA transmission complete(TC) callback for TIMER trigger DMA request */
static void _trigger_dma_full_transfer_complete(void *dma);
/* DMA error callback for TIMER all DMA request */
static void _timer_dma_error(void *dma);

/* enable TIMER */
static void _timer_enable(hal_timer_dev_struct *timer_dev);
/* disable TIMER */
static int32_t _timer_disable(hal_timer_dev_struct *timer_dev);
/* enable or disable TIMER primary output */
static void _timer_primary_output_config(hal_timer_dev_struct *timer_dev, ControlStatus state);


/*!
    \brief      initialize TIMER timebase
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which TIMER timebase is initialized
      \arg        TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  timer: TIMER basic init configuration struct
                  prescaler: prescaler value of the counter clock,0~65535
                  alignedmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_COUNTER_EDGE: edge-aligned mode
      \arg          TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg          TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg          TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
                  counter_direction:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_COUNTER_UP: counting up direction
      \arg          TIMER_COUNTER_DOWN: counting down direction
                  period: counter auto reload value,0~65535 (for TIMER1 0x00000000~0xFFFFFFFF)
                  clock_division:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CKDIV_DIV1: clock division value is 1, fDTS = fCK_TIMER
      \arg          TIMER_CKDIV_DIV2: clock division value is 2, fDTS = fCK_TIMER/2
      \arg          TIMER_CKDIV_DIV4: clock division value is 4, fDTS = fCK_TIMER/4
                  repetition_counter: counter repetition value,0~255
                  autoreload_shadow:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CARL_SHADOW_ENABLE: channel output shadow state enable
      \arg          TIMER_CARL_SHADOW_DISABLE: channel output shadow state disable
                  trgo_selection: the argument could be selected from enumeration <hal_timer_trgo_selection_enum>
                  master_slave_mode:
                  only one parameter can be selected which is shown as below:
      \arg          ENABLE: master slave mode enable
      \arg          DISABLE: master slave mode disable
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_init(hal_timer_dev_struct *timer_dev, uint32_t periph, hal_timer_init_struct *timer)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if((TIMER0 != periph) && (TIMER1 != periph) && (TIMER2 != periph) && (TIMER5 != periph)
            && (TIMER13 != periph) && (TIMER14 != periph) && (TIMER15 != periph) && (TIMER16 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }
#elif defined(GD32F330)
    /* check the parameters */
    if((TIMER0 != periph) && (TIMER1 != periph) && (TIMER2 != periph) && (TIMER13 != periph)
            && (TIMER14 != periph) && (TIMER15 != periph) && (TIMER16 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }
#else
    /* check the parameters */
    if((TIMER0 != periph) && (TIMER2 != periph) && (TIMER13 != periph)
            && (TIMER14 != periph) && (TIMER15 != periph) && (TIMER16 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* GD32F350 and GD32F330 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* TIMER periph settings */
    timer_dev->periph = periph;

