PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* initialize TIMER basic settings */
    /* configure the counter prescaler value */
    TIMER_PSC(periph) = (uint16_t)timer->prescaler;

#if (defined(GD32F350) || defined(GD32F330))
    /* configure the counter direction and aligned mode */
    if((TIMER0 == periph) || (TIMER1 == periph) || (TIMER2 == periph)) {
        TIMER_CTL0(periph) &= ~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM);
        TIMER_CTL0(periph) |= (uint32_t)timer->alignedmode;
        TIMER_CTL0(periph) |= (uint32_t)timer->counter_direction;
    }
    /* configure the autoreload value */
    TIMER_CAR(periph) = (uint32_t)timer->period;

    if((TIMER0 == periph) || (TIMER1 == periph) || (TIMER2 == periph) || (TIMER13 == periph)
            || (TIMER14 == periph) || (TIMER15 == periph) || (TIMER16 == periph)) {
        /* reset the CKDIV bit */
        TIMER_CTL0(periph) &= ~(uint32_t)TIMER_CTL0_CKDIV;
        TIMER_CTL0(periph) |= (uint32_t)timer->clock_division;
    }
#else
    /* configure the counter direction and aligned mode */
    if((TIMER0 == periph)  || (TIMER2 == periph)) {
        TIMER_CTL0(periph) &= ~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM);
        TIMER_CTL0(periph) |= (uint32_t)timer->alignedmode;
        TIMER_CTL0(periph) |= (uint32_t)timer->counter_direction;
    }
    /* configure the autoreload value */
    TIMER_CAR(periph) = (uint32_t)timer->period;

    if((TIMER0 == periph) || (TIMER2 == periph) || (TIMER13 == periph)
            || (TIMER14 == periph) || (TIMER15 == periph) || (TIMER16 == periph)) {
        /* reset the CKDIV bit */
        TIMER_CTL0(periph) &= ~(uint32_t)TIMER_CTL0_CKDIV;
        TIMER_CTL0(periph) |= (uint32_t)timer->clock_division;
    }
#endif

    if((TIMER0 == periph) || (TIMER14 == periph) || (TIMER15 == periph) || (TIMER16 == periph)) {
        /* configure the repetition counter value */
        TIMER_CREP(periph) = (uint32_t)timer->repetition_counter;
    }

    /* generate an update event */
    TIMER_SWEVG(periph) |= (uint32_t)TIMER_SWEVG_UPG;

    /* setting the shadow register for TIMERx_CAR register */
    TIMER_CTL0(periph) &= ~TIMER_CTL0_ARSE;
    TIMER_CTL0(periph) |= timer->autoreload_shadow;

    if((TIMER13 != periph) && (TIMER15 != periph) && (TIMER16 != periph)) {
        /* configure TIMER master slave mode */
        hals_timer_master_slave_mode_config(periph, timer->master_slave_mode);
        /* select TIMER master mode output trigger source */
        hals_timer_master_output_trigger_source_select(periph, timer->trgo_selection);
    }

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER input capture mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[in]  timer_inputcapture: TIMER input capture configuration structure
                  ic_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_POLARITY_RISING : input capture rising edge
      \arg          TIMER_IC_POLARITY_FALLING : input capture falling edge
      \arg          TIMER_IC_POLARITY_BOTH_EDGE : input capture both edge
                  ic_selection:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_SELECTION_DIRECTTI : channel y is configured as input and icy is mapped on CIy
      \arg          TIMER_IC_SELECTION_INDIRECTTI : channel y is configured as input and icy is mapped on opposite input
      \arg          TIMER_IC_SELECTION_ITS : channel y is configured as input and icy is mapped on ITS
                  ic_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_PRESCALER_OFF : no prescaler
      \arg          TIMER_IC_PRESCALER_DIV2 : divided by 2
      \arg          TIMER_IC_PRESCALER_DIV4 : divided by 4
      \arg          TIMER_IC_PRESCALER_DIV8 : divided by 8
                  ic_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_input_capture_config(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_input_capture_struct *timer_inputcapture)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_inputcapture)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_inputcapture] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if((((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) && (channel != TIMER_CH_0)) ||
            ((TIMER14 == timer_dev->periph) && (channel != TIMER_CH_0) && (channel != TIMER_CH_1)) ||
            (TIMER5 == timer_dev->periph)) {
        HAL_DEBUGE("the [channel] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) && (channel != TIMER_CH_0)) ||
            ((TIMER14 == timer_dev->periph) && (channel != TIMER_CH_0) && (channel != TIMER_CH_1))) {
        HAL_DEBUGE("the [channel] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* configure TIMER input capture parameter */
    hals_timer_channel_input_capture_config(timer_dev->periph, channel, timer_inputcapture);

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

