PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER output compare mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,2,13..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[in]  timer_outputcompare: TIMER output compare configuration structure
                  compare_mode: the argument could be selected from enumeration <hal_timer_output_compare_enum>
                  oc_pulse_value:0~65535,(for TIMER1 0x00000000~0xFFFFFFFF)
                  oc_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_POLARITY_HIGH : channel output polarity is high
      \arg          TIMER_OC_POLARITY_LOW : channel output polarity is low
                  oc_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_IDLE_STATE_LOW : idle state of channel output is high
      \arg          TIMER_OC_IDLE_STATE_HIGH : idle state of channel output is low
                  ocn_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_POLARITY_HIGH : channel complementary output polarity is high
      \arg          TIMER_OCN_POLARITY_LOW : channel complementary output polarity is low
                  ocn_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_IDLE_STATE_LOW : idle state of channel complementary output is high
      \arg          TIMER_OCN_IDLE_STATE_HIGH :  idle state of channel complementary output is low
                  oc_shadow:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_SHADOW_ENABLE : channel output compare shadow enable
      \arg          TIMER_OC_SHADOW_DISABLE : channel output compare shadow disable
                  oc_fastmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_FAST_ENABLE : channel output fast function enable
      \arg          TIMER_OC_FAST_DISABLE : channel output fast function disable
                  oc_clearmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_CLEAR_ENABLE : channel output clear function enable
      \arg          TIMER_OC_CLEAR_DISABLE : channel output clear function disable
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_config(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_output_compare_struct *timer_outputcompare)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_outputcompare)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_outputcompare] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if((((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) && (channel != TIMER_CH_0)) ||
            ((TIMER14 == timer_dev->periph) && (channel != TIMER_CH_0) && (channel != TIMER_CH_1)) ||
            (TIMER5 == timer_dev->periph)) {
        HAL_DEBUGE("the [channel] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) && (channel != TIMER_CH_0)) ||
            ((TIMER14 == timer_dev->periph) && (channel != TIMER_CH_0) && (channel != TIMER_CH_1))) {
        HAL_DEBUGE("the [channel] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* configure TIMER channel output compare mode */
    hals_timer_channel_output_config(timer_dev->periph, channel, timer_outputcompare);

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER break function
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_break: TIMER break and complementary channel protection configuration structure
                  run_offstate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_ROS_STATE_ENABLE : when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits
      \arg          TIMER_ROS_STATE_DISABLE : when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are disabled
                  idel_offstate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IOS_STATE_ENABLE : when POEN bit is reset, he channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits
      \arg          TIMER_IOS_STATE_DISABLE : when POEN bit is reset, the channel output signals (CHx_O/CHx_ON) are disabled
                  dead_time: 0~255
                  break_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_BREAK_POLARITY_LOW : break input polarity is low
      \arg          TIMER_BREAK_POLARITY_HIGH : break input polarity is high
                  output_autostate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OUTAUTO_ENABLE : output automatic enable
      \arg          TIMER_OUTAUTO_DISABLE : output automatic disable
                  protect_mode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CCHP_PROT_OFF : protect disable
      \arg          TIMER_CCHP_PROT_0 : PROT mode 0
      \arg          TIMER_CCHP_PROT_1 : PROT mode 1
      \arg          TIMER_CCHP_PROT_2 : PROT mode 2
                  break_state:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_BREAK_ENABLE : break input enable
      \arg          TIMER_BREAK_DISABLE : break input disable
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_break_config(hal_timer_dev_struct *timer_dev, hal_timer_break_struct *timer_break)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_break)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_break] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER14 != timer_dev->periph) && (TIMER15 != timer_dev->periph) && (TIMER16 != timer_dev->periph)) {
        HAL_DEBUGE("the break function of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* configure TIMER break function */
    TIMER_CCHP(timer_dev->periph) = (uint32_t)(((uint32_t)(timer_break->run_offstate)) |
                                    ((uint32_t)(timer_break->idel_offstate)) |
                                    ((uint32_t)(timer_break->dead_time)) |
                                    ((uint32_t)(timer_break->break_polarity)) |
                                    ((uint32_t)(timer_break->output_autostate)) |
                                    ((uint32_t)(timer_break->protect_mode)) |
                                    ((uint32_t)(timer_break->break_state)));
    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

