PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER OCPRE clear source
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_clearsource: TIMER output compare clear source configuration structure
                  clear_source:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCPRE_CLEAR_SOURCE_CLR: OCPRE_CLR_INT is connected to the OCPRE_CLR input
      \arg          TIMER_OCPRE_CLEAR_SOURCE_ETIF: OCPRE_CLR_INT is connected to ETIF
                  exttrigger_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_POLARITY_RISING : active high or rising edge active
      \arg          TIMER_EXT_TRI_POLARITY_FALLING : active low or falling edge active
                  exttrigger_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PRESCALER_OFF : no divided
      \arg          TIMER_EXT_TRI_PRESCALER_DIV2 : divided by 2
      \arg          TIMER_EXT_TRI_PRESCALER_DIV4 : divided by 4
      \arg          TIMER_EXT_TRI_PRESCALER_DIV8 : divided by 8
                  exttrigger_filter: external trigger filter control,0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_ocpre_clear_source_config(hal_timer_dev_struct *timer_dev, hal_timer_clear_source_struct *timer_clearsource)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_clearsource)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_clearsource] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if (defined(GD32F350) || defined(GD32F330))
    /* check the parameters */
    if((timer_clearsource-> clear_source == TIMER_OCPRE_CLEAR_SOURCE_ETIF) &&
            (TIMER0 != timer_dev->periph) && (TIMER1 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the TIMER_OCPRE_CLEAR_SOURCE_ETIF of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((timer_clearsource-> clear_source == TIMER_OCPRE_CLEAR_SOURCE_ETIF) &&
            (TIMER0 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the TIMER_OCPRE_CLEAR_SOURCE_ETIF of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 and GD32F330 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* configure TIMER channel output clear function */
    if(TIMER_OCPRE_CLEAR_SOURCE_ETIF == timer_clearsource->clear_source) {
        /* set OCRC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SMCFG_OCRC;
        /* configure TIMER external trigger input */
        hals_timer_external_trigger_config(timer_dev->periph, timer_clearsource->exttrigger_prescaler, timer_clearsource->exttrigger_polarity, timer_clearsource->exttrigger_filter);
    } else if(TIMER_OCPRE_CLEAR_SOURCE_CLR == timer_clearsource->clear_source) {
        /* reset OCRC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_OCRC;
    } else {
        /* illegal parameters */
        HAL_DEBUGW("parameter [timer_clearsource->clear_source] value is undefine");
        return HAL_ERR_VAL;
    }

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER ci0 trigger input
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  ci0_select:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CI0_CH0IN: the TIMERx_CH0 pin input is selected as channel 0 trigger input
      \arg        TIMER_CI0_XOR_CH012: the result of combinational XOR of TIMERx_CH0,CH1 and CH2 pins is selected as channel 0 trigger input
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_ci0_input_select(hal_timer_dev_struct *timer_dev, uint32_t ci0_select)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if (defined(GD32F350) || defined(GD32F330))
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER1 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the TIMER_CI0_XOR_CH012 of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the TIMER_CI0_XOR_CH012 of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 and GD32F330 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    if(TIMER_CI0_XOR_CH012 == ci0_select) {
        /* set TI0S bit */
        TIMER_CTL1(timer_dev->periph) |= (uint32_t)TIMER_CTL1_TI0S;
    } else if(TIMER_CI0_CH0IN == ci0_select) {
        /* reset TI0S bit */
        TIMER_CTL1(timer_dev->periph) &= ~(uint32_t)TIMER_CTL1_TI0S;
    } else {
        /* illegal parameters */
        HAL_DEBUGW("parameter [ci0_select] value is undefine");
        return HAL_ERR_VAL;
    }

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  single_pulse:
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: single pulse mode enable
      \arg        DISABLE: single pulse mode disable
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_mode_config(hal_timer_dev_struct *timer_dev, uint32_t single_pulse)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(TIMER13 == timer_dev->periph) {
        HAL_DEBUGE("the single pulse mode of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* configure TIMER single pulse mode */
    if(ENABLE == single_pulse) {
        /* set SPM bit */
        TIMER_CTL0(timer_dev->periph) |= (uint32_t)TIMER_CTL0_SPM;
    } else if(DISABLE == single_pulse) {
        /* reset SPM bit */
        TIMER_CTL0(timer_dev->periph) &= ~((uint32_t)TIMER_CTL0_SPM);
    } else {
        /* illegal parameters */
        HAL_DEBUGW("parameter [single_pulse] value is undefine");
        return HAL_ERR_VAL;
    }

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

