PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER clock source
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_clocksource: TIMER clock source configuration structure
                  clock_source: the argument could be selected from enumeration <hal_timer_clock_sourc_enum>
                  clock_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING: clock input source is ETI, active high or rising edge active
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_FALLING: clock input source is ETI, active low or falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_RISING: clock input source is CIx(x=0,1), rising edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_FALLING: clock input source is CIx(x=0,1), falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_BOTH_EDGE: clock input source is CI0F_ED, both rising and falling edge active
                  clock_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PRESCALER_OFF: external trigger no divided
      \arg          TIMER_EXT_TRI_PRESCALER_DIV2: external trigger divided by 2
      \arg          TIMER_EXT_TRI_PRESCALER_DIV4: external trigger divided by 4
      \arg          TIMER_EXT_TRI_PRESCALER_DIV8: external trigger divided by 8
                  clock_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_clock_source_config(hal_timer_dev_struct *timer_dev, hal_timer_clock_source_struct *timer_clocksource)
{
    uint32_t smc_val, trgs_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_clocksource)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_clocksource] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if(((TIMER_CLOCK_SOURCE_CK_TIMER != timer_clocksource->clock_source) && ((TIMER5 == timer_dev->periph) || (TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph))) ||
            (((TIMER_CLOCK_SOURCE_ETIMODE0 == timer_clocksource->clock_source) || (TIMER_CLOCK_SOURCE_ETIMODE1 == timer_clocksource->clock_source)) && (TIMER14 == timer_dev->periph))) {
        HAL_DEBUGE("the [timer_clocksource->clock_source] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if(((TIMER_CLOCK_SOURCE_CK_TIMER != timer_clocksource->clock_source) && ((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph))) ||
            (((TIMER_CLOCK_SOURCE_ETIMODE0 == timer_clocksource->clock_source) || (TIMER_CLOCK_SOURCE_ETIMODE1 == timer_clocksource->clock_source)) && (TIMER14 == timer_dev->periph))) {
        HAL_DEBUGE("the [timer_clocksource->clock_source] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* read SMC, SMC1 and TRGS bits */
    smc_val = (uint32_t)(TIMER_SMCFG(timer_dev->periph) & TIMER_SMCFG_SMC);
    trgs_val = (uint32_t)(TIMER_SMCFG(timer_dev->periph) & TIMER_SMCFG_TRGS);

    /* reset the SMC1 bit */
    TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC1;

    switch(timer_clocksource->clock_source) {
    case TIMER_CLOCK_SOURCE_CK_TIMER:
        if((smc_val != TIMER_SLAVE_MODE_RESTART) && (smc_val != TIMER_SLAVE_MODE_PAUSE) && (smc_val != TIMER_SLAVE_MODE_EVENT)) {
            /* reset the SMC bit */
            TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        }
        break;
    case TIMER_CLOCK_SOURCE_ITI0:
        /* configure TIMER the internal trigger as external clock input */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_ITI0);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_ITI1:
        /* configure TIMER the internal trigger as external clock input */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_ITI1);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_ITI2:
        /* configure TIMER the internal trigger as external clock input */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_ITI2);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_ITI3:
        /* configure TIMER the internal trigger as external clock input */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_ITI3);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_CI0FE0:
        /* configure TIMER the external trigger as external clock input */
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH0NEN));
        /* reset the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        /* set the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)timer_clocksource->clock_polarity;
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)(timer_clocksource->clock_filter << 4U);
        /* select TIMER input trigger source */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI0FE0);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= ~(uint32_t)TIMER_SMCFG_SMC;
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_CI1FE1:
        /* configure TIMER the external trigger as external clock input */
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH1NP bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
        /* set the CH1NP bit */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)((uint32_t)timer_clocksource->clock_polarity << 4U);
        /* reset the CH1CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
        /* set the CH1CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)(timer_clocksource->clock_filter << 12U);
        /* select TIMER input trigger source */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI1FE1);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_CI0FED:
        /* configure TIMER the external trigger as external clock input */
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH0NEN));
        /* reset the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        /* set the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)timer_clocksource->clock_polarity;
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)(timer_clocksource->clock_filter << 4U);
        /* select TIMER input trigger source */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI0F_ED);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_ETIMODE0:
        /* configure TIMER external trigger input */
        hals_timer_external_trigger_config(timer_dev->periph, timer_clocksource ->clock_prescaler,
                                           timer_clocksource->clock_polarity, timer_clocksource->clock_filter);
        /* select TIMER input trigger source */
        hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_ETIFP);
        /* reset the SMC bit */
        TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
        /* set the SMC bit */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case TIMER_CLOCK_SOURCE_ETIMODE1:
        if((smc_val != TIMER_SLAVE_MODE_RESTART) && (smc_val != TIMER_SLAVE_MODE_PAUSE) && (smc_val != TIMER_SLAVE_MODE_EVENT)) {
            /* reset the SMC bit */
            TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
        }
        if(trgs_val == TIMER_SMCFG_TRGSEL_ETIFP) {
            /* reset TRGS bits */
            TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_TRGS);
        }
        /* configure TIMER external trigger input */
        hals_timer_external_trigger_config(timer_dev->periph, timer_clocksource ->clock_prescaler,
                                           timer_clocksource->clock_polarity, timer_clocksource->clock_filter);
        /* configure TIMER the external clock mode1 */
        TIMER_SMCFG(timer_dev->periph) |= (uint32_t)TIMER_SMCFG_SMC1;
        break;
    default:
        HAL_DEBUGW("parameter [timer_clocksource->clock_source] value is undefine");
        return HAL_ERR_VAL;
    }

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

