PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER slave mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_slavemode: TIMER slave mode configuration structure
                  slavemode: the argument could be selected from enumeration <hal_timer_slave_mode_enum>
                  trigger_selection: the argument could be selected from enumeration <hal_timer_input_trigger_source_enum>
                  trigger_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING: trigger input source is ETI, active high or rising edge active
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_FALLING: trigger input source is ETI, active low or falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_RISING: trigger input source is CIx(x=0,1), rising edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_FALLING: trigger input source is CIx(x=0,1), falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_BOTH_EDGE: trigger input source is CI0F_ED, both rising and falling edge active
                  trigger_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PRESCALER_OFF: external trigger no divided
      \arg          TIMER_EXT_TRI_PRESCALER_DIV2: external trigger divided by 2
      \arg          TIMER_EXT_TRI_PRESCALER_DIV4: external trigger divided by 4
      \arg          TIMER_EXT_TRI_PRESCALER_DIV8: external trigger divided by 8
                  trigger_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_slave_mode_config(hal_timer_dev_struct *timer_dev, hal_timer_slave_mode_struct *timer_slavemode)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_slavemode)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_slavemode] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if((TIMER5 == timer_dev->periph) || (TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->slavemode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->slavemode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
    /* check the parameters */
    if((TIMER_TRIGGER_SOURCE_ETIFP == timer_slavemode->trigger_selection) && (TIMER14 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->trigger_selection] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
    if(TIMER_TRIGGER_SOURCE_DISABLE == timer_slavemode->trigger_selection) {
        HAL_DEBUGE("the [timer_slavemode->trigger_selection] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* disable the TIMER interrupt */
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_TRG);
    /* disable the TIMER DMA trigger request */
    hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);

    switch(timer_slavemode->trigger_selection) {
    case TIMER_TRIGGER_SOURCE_ITI0:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI1:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI2:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI3:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_CI0FE0:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH0NEN));
        /* reset the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        /* config polarity */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)(timer_slavemode->trigger_polarity);
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
        break;
    case TIMER_TRIGGER_SOURCE_CI1FE1:
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH1P and CH1NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
        /* config polarity */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_polarity) << 4U);
        /* reset the CH1CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 12U);
        break;
    case TIMER_TRIGGER_SOURCE_CI0FED:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
        break;
    case TIMER_TRIGGER_SOURCE_ETIFP:
        /* configure TIMER external trigger input */
        hals_timer_external_trigger_config(timer_dev->periph, timer_slavemode->trigger_prescaler,
                                           timer_slavemode->trigger_polarity, timer_slavemode->trigger_filter);
        break;
    default:
        HAL_DEBUGW("parameter [timer_slavemode->trigger_selection] value is undefine");
        return HAL_ERR_VAL;
    }

    /* select TIMER input trigger source  */
    hals_timer_input_trigger_source_select(timer_dev->periph, timer_slavemode->trigger_selection);
    /* select TIMER slave mode */
    hals_timer_slave_mode_select(timer_dev->periph, timer_slavemode->slavemode);

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

