PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER decoder mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_decoder: TIMER decoder mode configuration structure
                  decoder_mode: the argument could be selected from enumeration <hal_timer_decoder_mode_enum>
                  ci0_polarity/ci1_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_POLARITY_RISING : input capture rising edge
      \arg          TIMER_IC_POLARITY_FALLING : input capture falling edge
                  ci0_selection/ci1_selection:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_SELECTION_DIRECTTI : channel y is configured as input and icy is mapped on CIy
      \arg          TIMER_IC_SELECTION_INDIRECTTI : channel y is configured as input and icy is mapped on opposite input
      \arg          TIMER_IC_SELECTION_ITS : channel y is configured as input and icy is mapped on ITS
                  ci0_prescaler/ci1_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_PRESCALER_OFF : no prescaler
      \arg          TIMER_IC_PRESCALER_DIV2 : divided by 2
      \arg          TIMER_IC_PRESCALER_DIV4 : divided by 4
      \arg          TIMER_IC_PRESCALER_DIV8 : divided by 8
                  ci0_filter/ci1_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_config(hal_timer_dev_struct *timer_dev, hal_timer_decoder_struct *timer_decoder)
{
    static hal_timer_input_capture_struct ic0_capture;
    static hal_timer_input_capture_struct ic1_capture;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_decoder)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_decoder] address is invalid");
        return HAL_ERR_ADDRESS;
    }

#if (defined(GD32F350) || defined(GD32F330))
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER1 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the [timer_decoder->decoder_mode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the [timer_decoder->decoder_mode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    TIMER_SMCFG(timer_dev->periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
    TIMER_SMCFG(timer_dev->periph) |= (uint32_t)timer_decoder->decoder_mode;

    /* channel 0 input parameter structure */
    ic0_capture.ic_polarity = timer_decoder->ci0_polarity;
    ic0_capture.ic_selection = timer_decoder->ci0_selection;
    ic0_capture.ic_prescaler = timer_decoder->ci0_prescaler;
    ic0_capture.ic_filter = timer_decoder->ci0_filter;
    /* channel 1 input parameter structure */
    ic1_capture.ic_polarity = timer_decoder->ci1_polarity;
    ic1_capture.ic_selection = timer_decoder->ci1_selection;
    ic1_capture.ic_prescaler = timer_decoder->ci1_prescaler;
    ic1_capture.ic_filter = timer_decoder->ci1_filter;
    /* configure TIMER input capture parameter */
    hals_timer_channel_input_capture_config(timer_dev->periph, TIMER_CH_0, &ic0_capture);
    /* configure TIMER input capture parameter */
    hals_timer_channel_input_capture_config(timer_dev->periph, TIMER_CH_1, &ic1_capture);

    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER hall sensor mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_hallsensor: TIMER hall sensor mode configuration structure
                  cmt_delay: commutation delay(channel 1 compare value)
                  ci0_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_POLARITY_RISING : input capture rising edge
                  ci0_selection:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_SELECTION_ITS : channel y is configured as input and icy is mapped on ITS
                  ci0_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_PRESCALER_OFF : no prescaler
      \arg          TIMER_IC_PRESCALER_DIV2 : divided by 2
      \arg          TIMER_IC_PRESCALER_DIV4 : divided by 4
      \arg          TIMER_IC_PRESCALER_DIV8 : divided by 8
                  ci0_filter: 0~15
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_config(hal_timer_dev_struct *timer_dev, hal_timer_hall_sensor_struct *timer_hallsensor)
{
    static hal_timer_input_capture_struct input_capture;
    static hal_timer_output_compare_struct output_compare;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_hallsensor)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_hallsensor] address is invalid");
        return HAL_ERR_ADDRESS;
    }

#if (defined(GD32F350) || defined(GD32F330))
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER1 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the hall sensor mode of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((TIMER0 != timer_dev->periph) && (TIMER2 != timer_dev->periph)) {
        HAL_DEBUGE("the hall sensor mode of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
#endif /* 1 == HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

    /* structure parameter config */
    input_capture.ic_polarity  = timer_hallsensor->ci0_polarity;
    input_capture.ic_selection = timer_hallsensor->ci0_selection;
    input_capture.ic_prescaler = timer_hallsensor->ci0_prescaler;
    input_capture.ic_filter    = timer_hallsensor->ci0_filter;
    hals_timer_channel_input_capture_config(timer_dev->periph, TIMER_CH_0, &input_capture);

