PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* configure TIMER hall sensor mode*/
    /* set TI0S bit */
    TIMER_CTL1(timer_dev->periph) |= (uint32_t)TIMER_CTL1_TI0S;
    /* select TIMER input trigger source */
    hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI0F_ED);
    /* select TIMER slave mode */
    hals_timer_slave_mode_select(timer_dev->periph, TIMER_SLAVE_MODE_RESTART);

    /* TIMER output compare mode structure config */
    output_compare.compare_mode = TIMER_OC_MODE_PWM0;
    output_compare.oc_pulse_value = timer_hallsensor->cmt_delay;
    output_compare.oc_polarity = TIMER_OC_POLARITY_HIGH;
    output_compare.ocn_polarity = TIMER_OCN_POLARITY_HIGH;
    output_compare.oc_idlestate = TIMER_OC_IDLE_STATE_LOW;
    output_compare.ocn_idlestate = TIMER_OCN_IDLE_STATE_LOW;
    output_compare.oc_shadow = TIMER_OC_SHADOW_ENABLE;
    output_compare.oc_fastmode = TIMER_OC_FAST_DISABLE;
    output_compare.oc_clearmode = TIMER_OC_CLEAR_DISABLE;
    /* initialize TIMER output compare mode */
    hals_timer_channel_output_config(timer_dev->periph, TIMER_CH_1, &output_compare);

    /* select TIMER master mode output trigger source */
    hals_timer_master_output_trigger_source_select(timer_dev->periph, TIMER_TRI_OUT_SRC_O1CPRE);
    /* change TIMER state */
    timer_dev->state = HAL_TIMER_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize TIMER structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_timer_struct_type_enum>
    \param[in]  p_struct: pointer to TIMER structure that contains the configuration information
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_struct_init(hal_timer_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_TIMER_INIT_STRUCT:
        /* initialize TIMER basic init configuration structure with the default values */
        ((hal_timer_init_struct *)p_struct)->prescaler          = 0U;
        ((hal_timer_init_struct *)p_struct)->alignedmode        = TIMER_COUNTER_EDGE;
        ((hal_timer_init_struct *)p_struct)->counter_direction  = TIMER_COUNTER_UP;
        ((hal_timer_init_struct *)p_struct)->period             = 65535U;
        ((hal_timer_init_struct *)p_struct)->clock_division     = TIMER_CKDIV_DIV1;
        ((hal_timer_init_struct *)p_struct)->repetition_counter = 0U;
        ((hal_timer_init_struct *)p_struct)->autoreload_shadow  = TIMER_CARL_SHADOW_DISABLE;
        ((hal_timer_init_struct *)p_struct)->trgo_selection     = TIMER_TRI_OUT_SRC_RESET;
        ((hal_timer_init_struct *)p_struct)->master_slave_mode  = DISABLE;
        break;
    case HAL_TIMER_INPUT_CAPTURE_STRUCT:
        /* initialize TIMER input capture configuration structure with the default values */
        ((hal_timer_input_capture_struct *)p_struct)->ic_polarity     = TIMER_IC_POLARITY_RISING;
        ((hal_timer_input_capture_struct *)p_struct)->ic_selection    = TIMER_IC_SELECTION_DIRECTTI;
        ((hal_timer_input_capture_struct *)p_struct)->ic_prescaler    = TIMER_IC_PRESCALER_OFF;
        ((hal_timer_input_capture_struct *)p_struct)->ic_filter       = 0U;
        break;
    case HAL_TIMER_OUTPUT_COMPARE_STRUCT:
        /* initialize TIMER output compare configuration structure with the default values */
        ((hal_timer_output_compare_struct *)p_struct)->compare_mode   = TIMER_OC_MODE_TIMING;
        ((hal_timer_output_compare_struct *)p_struct)->oc_pulse_value = 0U;
        ((hal_timer_output_compare_struct *)p_struct)->oc_polarity    = TIMER_OC_POLARITY_HIGH;
        ((hal_timer_output_compare_struct *)p_struct)->oc_idlestate   = TIMER_OC_IDLE_STATE_LOW;
        ((hal_timer_output_compare_struct *)p_struct)->ocn_polarity   = TIMER_OCN_POLARITY_HIGH ;
        ((hal_timer_output_compare_struct *)p_struct)->ocn_idlestate  = TIMER_OCN_IDLE_STATE_LOW;
        ((hal_timer_output_compare_struct *)p_struct)->oc_shadow      = TIMER_OC_SHADOW_DISABLE;
        ((hal_timer_output_compare_struct *)p_struct)->oc_fastmode    = TIMER_OC_FAST_DISABLE;
        ((hal_timer_output_compare_struct *)p_struct)->oc_clearmode   = TIMER_OC_CLEAR_DISABLE;
        break;
    case HAL_TIMER_BREAK_STRUCT:
        /* initialize TIMER break and complementary channel protection configuration structure with the default values */
        ((hal_timer_break_struct *)p_struct)->run_offstate     = TIMER_ROS_STATE_DISABLE;
        ((hal_timer_break_struct *)p_struct)->idel_offstate    = TIMER_IOS_STATE_DISABLE;
        ((hal_timer_break_struct *)p_struct)->dead_time        = 0U;
        ((hal_timer_break_struct *)p_struct)->break_polarity   = TIMER_BREAK_POLARITY_HIGH;
        ((hal_timer_break_struct *)p_struct)->output_autostate = TIMER_OUTAUTO_DISABLE;
        ((hal_timer_break_struct *)p_struct)->protect_mode     = TIMER_CCHP_PROT_OFF;
        ((hal_timer_break_struct *)p_struct)->break_state      = TIMER_BREAK_DISABLE;
        break;
    case HAL_TIMER_CLEAR_SOURCE_STRUCT:
        /* initialize TIMER external trigger ETI configuration structure with the default values */
        ((hal_timer_clear_source_struct *)p_struct)->clear_source         = TIMER_OCPRE_CLEAR_SOURCE_CLR;
        ((hal_timer_clear_source_struct *)p_struct)->exttrigger_polarity  = TIMER_EXT_TRI_POLARITY_RISING;
        ((hal_timer_clear_source_struct *)p_struct)->exttrigger_prescaler = TIMER_EXT_TRI_PRESCALER_OFF;
        ((hal_timer_clear_source_struct *)p_struct)->exttrigger_filter    = 0U;
        break;
    case HAL_TIMER_CLOCK_SOURCE_STRUCT:
        /* initialize TIMER external trigger ETI configuration structure with the default values */
        ((hal_timer_clock_source_struct *)p_struct)->clock_source    = TIMER_CLOCK_SOURCE_CK_TIMER;
        ((hal_timer_clock_source_struct *)p_struct)->clock_polarity  = TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING;
        ((hal_timer_clock_source_struct *)p_struct)->clock_prescaler = TIMER_EXT_TRI_PRESCALER_OFF;
        ((hal_timer_clock_source_struct *)p_struct)->clock_filter    = 0U;
        break;
    case HAL_TIMER_SLAVE_MODE_STRUCT:
        /* initialize TIMER slave mode configuration structure with the default values */
        ((hal_timer_slave_mode_struct *)p_struct)->slavemode         = TIMER_SLAVE_DISABLE_MODE;
        ((hal_timer_slave_mode_struct *)p_struct)->trigger_selection = TIMER_TRIGGER_SOURCE_ITI0;
        ((hal_timer_slave_mode_struct *)p_struct)->trigger_polarity  = TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING;
        ((hal_timer_slave_mode_struct *)p_struct)->trigger_prescaler = TIMER_EXT_TRI_PRESCALER_OFF;
        ((hal_timer_slave_mode_struct *)p_struct)->trigger_filter    = 0U;
        break;
    case HAL_TIMER_DECODER_STRUCT:
        /* initialize TIMER decoder mode configuration structure with the default values */
        ((hal_timer_decoder_struct *)p_struct)->decoder_mode  = TIMER_QUADRATURE_DECODER_MODE0;
        ((hal_timer_decoder_struct *)p_struct)->ci0_polarity  = TIMER_IC_POLARITY_RISING;
        ((hal_timer_decoder_struct *)p_struct)->ci0_selection = TIMER_IC_SELECTION_DIRECTTI;
        ((hal_timer_decoder_struct *)p_struct)->ci0_prescaler = TIMER_IC_PRESCALER_OFF;
        ((hal_timer_decoder_struct *)p_struct)->ci0_filter    = 0U;
        ((hal_timer_decoder_struct *)p_struct)->ci1_polarity  = TIMER_IC_POLARITY_RISING;
        ((hal_timer_decoder_struct *)p_struct)->ci1_selection = TIMER_IC_SELECTION_DIRECTTI;
        ((hal_timer_decoder_struct *)p_struct)->ci1_prescaler = TIMER_IC_PRESCALER_OFF;
        ((hal_timer_decoder_struct *)p_struct)->ci1_filter    = 0U;
        break;
    case HAL_TIMER_DECODER_DMA_CONFIG_STRUCT:
        /* initialize TIMER decoder mode DMA transfer configuration structure with the default values */
        ((hal_timer_decoder_dma_config_struct *)p_struct)->mem_addr0 = NULL;
        ((hal_timer_decoder_dma_config_struct *)p_struct)->mem_addr1 = NULL;
        ((hal_timer_decoder_dma_config_struct *)p_struct)->length    = 0U;
        break;
    case HAL_TIMER_HALL_SENSOR_STRUCT:
        /* initialize TIMER HALL sensor mode configuration structure with the default values */
        ((hal_timer_hall_sensor_struct *)p_struct)->cmt_delay     = 0U;
        ((hal_timer_hall_sensor_struct *)p_struct)->ci0_polarity  = TIMER_IC_POLARITY_RISING;
        ((hal_timer_hall_sensor_struct *)p_struct)->ci0_selection = TIMER_IC_SELECTION_ITS;
        ((hal_timer_hall_sensor_struct *)p_struct)->ci0_prescaler = TIMER_IC_PRESCALER_OFF;
        ((hal_timer_hall_sensor_struct *)p_struct)->ci0_filter    = 0U;
        break;
    case HAL_TIMER_SINGLE_PULSE_STRUCT:
        /* initialize TIMER HALL sensor mode configuration structure with the default values */
        ((hal_timer_single_pulse_struct *)p_struct)->sp_compare_mode   = TIMER_OC_MODE_TIMING;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_oc_pulse_value = 0U;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_oc_polarity    = TIMER_OC_POLARITY_HIGH;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_ocn_polarity   = TIMER_OCN_POLARITY_HIGH;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_oc_idlestate   = TIMER_OC_IDLE_STATE_LOW;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_ocn_idlestate  = TIMER_OCN_IDLE_STATE_LOW;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_oc_fastmode    = TIMER_OC_FAST_DISABLE;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_oc_clearmode   = TIMER_OC_CLEAR_DISABLE;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_ic_polarity    = TIMER_IC_POLARITY_RISING;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_ic_selection   = TIMER_IC_SELECTION_DIRECTTI;
        ((hal_timer_single_pulse_struct *)p_struct)->sp_ic_filter      = 0U;
        break;
    case HAL_TIMER_DMA_TRANSFER_CONFIG_STRUCT:
        /* initialize TIMER DMA transfer configuration structure with the default values */
        ((hal_timer_dma_transfer_config_struct *)p_struct)->start_addr = TIMER_DMA_START_ADDRESS_CTL0;
        ((hal_timer_dma_transfer_config_struct *)p_struct)->mem_addr   = NULL;
        ((hal_timer_dma_transfer_config_struct *)p_struct)->length     = TIMER_DMACFG_DMATC_1TRANSFER;
        break;
    case HAL_TIMER_IRQ_STRUCT:
        /* initialize TIMER interrupt user callback function pointer structure with the default values */
        ((hal_timer_irq_struct *)p_struct)->update_handle           = NULL;
        ((hal_timer_irq_struct *)p_struct)->channelx_capture_handle = NULL;
        ((hal_timer_irq_struct *)p_struct)->channelx_compare_handle = NULL;
        ((hal_timer_irq_struct *)p_struct)->commutation_handle      = NULL;
        ((hal_timer_irq_struct *)p_struct)->trigger_handle          = NULL;
        ((hal_timer_irq_struct *)p_struct)->break_handle            = NULL;
        break;
    case HAL_TIMER_DMA_HANDLE_CB_STRUCT:
        /* initialize TIMER DMA interrupt user callback function pointer structure with the default values */
        ((hal_timer_dma_handle_cb_struct *)p_struct)->update_dma_full_transcom_handle           = NULL;
        ((hal_timer_dma_handle_cb_struct *)p_struct)->channelx_capture_dma_full_transcom_handle = NULL;
        ((hal_timer_dma_handle_cb_struct *)p_struct)->channelx_compare_dma_full_transcom_handle = NULL;
        ((hal_timer_dma_handle_cb_struct *)p_struct)->commutation_dma_full_transcom_handle      = NULL;
        ((hal_timer_dma_handle_cb_struct *)p_struct)->trigger_dma_full_transcom_handle          = NULL;
        ((hal_timer_dma_handle_cb_struct *)p_struct)->error_handle                              = NULL;
        break;
    case HAL_TIMER_DEV_STRUCT:
        /* initialize TIMER device information structure with the default values */
        ((hal_timer_dev_struct *)p_struct)->periph = 0;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.update_handle                             = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.channelx_capture_handle                   = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.channelx_compare_handle                   = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.commutation_handle                        = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.trigger_handle                            = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_irq.break_handle                              = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[0]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[1]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[2]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[3]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[4]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[5]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->p_dma_timer[6]                                      = NULL;
        ((hal_timer_dev_struct *)p_struct)->service_channel                                     = HAL_TIMER_SERVICE_CHANNEL_NONE;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.update_dma_full_transcom_handle           = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.channelx_capture_dma_full_transcom_handle = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.channelx_compare_dma_full_transcom_handle = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.commutation_dma_full_transcom_handle      = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.trigger_dma_full_transcom_handle          = NULL;
        ((hal_timer_dev_struct *)p_struct)->timer_dma.error_handle                              = NULL;
        ((hal_timer_dev_struct *)p_struct)->error_state                                         = HAL_TIMER_ERROR_NONE;
        ((hal_timer_dev_struct *)p_struct)->state                                               = HAL_TIMER_STATE_NONE;
        ((hal_timer_dev_struct *)p_struct)->mutex                                               = HAL_MUTEX_UNLOCKED;
        break;
    default:
        HAL_DEBUGW("parameter [struct_type] value is undefine");
        return HAL_ERR_VAL;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      deinitialize TIMER and device structure
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_deinit(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    timer_dev->state = HAL_TIMER_STATE_BUSY;

