PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* deinit a TIMER */
    switch(timer_dev->periph) {
    case TIMER0:
        /* reset TIMER0 */
        hal_rcu_periph_reset_enable(RCU_TIMER0RST);
        hal_rcu_periph_reset_disable(RCU_TIMER0RST);
        break;

#if (defined(GD32F350) || defined(GD32F330))
    case TIMER1:
        /* reset TIMER1 */
        hal_rcu_periph_reset_enable(RCU_TIMER1RST);
        hal_rcu_periph_reset_disable(RCU_TIMER1RST);
        break;
#endif
    case TIMER2:
        /* reset TIMER2 */
        hal_rcu_periph_reset_enable(RCU_TIMER2RST);
        hal_rcu_periph_reset_disable(RCU_TIMER2RST);
        break;
#ifdef GD32F350
    case TIMER5:
        /* reset TIMER5 */
        hal_rcu_periph_reset_enable(RCU_TIMER5RST);
        hal_rcu_periph_reset_disable(RCU_TIMER5RST);
        break;
#endif
    case TIMER13:
        /* reset TIMER13 */
        hal_rcu_periph_reset_enable(RCU_TIMER13RST);
        hal_rcu_periph_reset_disable(RCU_TIMER13RST);
        break;
    case TIMER14:
        /* reset TIMER14 */
        hal_rcu_periph_reset_enable(RCU_TIMER14RST);
        hal_rcu_periph_reset_disable(RCU_TIMER14RST);
        break;
    case TIMER15:
        /* reset TIMER15 */
        hal_rcu_periph_reset_enable(RCU_TIMER15RST);
        hal_rcu_periph_reset_disable(RCU_TIMER15RST);
        break;
    case TIMER16:
        /* reset TIMER16 */
        hal_rcu_periph_reset_enable(RCU_TIMER16RST);
        hal_rcu_periph_reset_disable(RCU_TIMER16RST);
        break;
    default:
        break;
    }

    /* initialize the TIMER structure with the default values */
    hal_timer_struct_init(HAL_TIMER_DEV_STRUCT, timer_dev);
    /* change TIMER error state, service channel and state */
    timer_dev->error_state = HAL_TIMER_ERROR_NONE;
    timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
    timer_dev->state = HAL_TIMER_STATE_RESET;

    return HAL_ERR_NONE;
}

/*!
    \brief      start TIMER counter
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_counter_start(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    _timer_enable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER counter
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_counter_stop(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER counter and update interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_counter_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [timer_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* TIMER update interrupt handler set */
    timer_dev->timer_irq.update_handle = p_irq->update_handle;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_UP);
    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_UP);
    /* enable a TIMER */
    _timer_enable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER counter and update interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_counter_stop_interrupt(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    timer_dev->timer_irq.update_handle = NULL;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_UP);
    /* disable the TIMER interrupt */
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_UP);
    /* enable a TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER counter and update DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dmacb: TIMER DMA callback function pointer structure
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[in]  mem_addr: TIMER DMA transfer memory address
    \param[in]  dma_length: TIMER DMA transfer count, 0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_counter_start_dma(hal_timer_dev_struct *timer_dev, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check the parameters */
    if(NULL == mem_addr) {
        HAL_DEBUGE("pointer [mem_addr] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    timer_dev->timer_dma.update_dma_full_transcom_handle = dmacb->update_dma_full_transcom_handle;
    timer_dev->timer_dma.error_handle = dmacb->error_handle;

    timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.full_finish_handle = _update_dma_full_transfer_complete;
    timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.half_finish_handle = NULL;
    timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.error_handle = _timer_dma_error;

    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_UP], (uint32_t)mem_addr, TIMER_CAR_ADDRESS(timer_dev->periph), dma_length, NULL);
    /* enable the TIMER DMA update request */
    hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_UPD);
    /* enable a TIMER */
    _timer_enable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

