PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    case TIMER_CH_2:
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.error_handle = _timer_dma_error;
        /* enable the DMA CH2 interrupt */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2], (uint32_t)mem_addr, TIMER_CH2CV_ADDRESS(timer_dev->periph), dma_length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
        break;

    case TIMER_CH_3:
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.error_handle = _timer_dma_error;
        /* enable the DMA CH3 interrupt */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH3], (uint32_t)mem_addr, TIMER_CH3CV_ADDRESS(timer_dev->periph), dma_length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH3D);
        break;

    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    _timer_enable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER channel output compare mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,14..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(channel) {
    case TIMER_CH_0:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);
        break;

    case TIMER_CH_1:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]);
        break;

    case TIMER_CH_2:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]);
        break;

    case TIMER_CH_3:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH3D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]);
        break;
    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, channel, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementary channel output compare mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_start(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* configure TIMER channel complementary output enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    _timer_enable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary channel output compare mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_stop(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* configure TIMER channel complementary output enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementary channel output compare mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = p_irq->channelx_compare_handle;

    switch(channel) {
    case TIMER_CH_0:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        /* enable the TIMER compare 0 interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        break;

    case TIMER_CH_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* enable the TIMER compare 1 interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        break;

