PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    case TIMER_CH_2:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH2);
        /* enable the TIMER compare 2 interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH2);
        break;

    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel complementary output enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    _timer_enable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary channel output compare mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* TIMER output compare interrupt handler reset */
    timer_dev->timer_irq.channelx_compare_handle = NULL;
    switch(channel) {
    case TIMER_CH_0:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        /* disable the TIMER compare 0 interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
        break;

    case TIMER_CH_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* disable the TIMER compare 1 interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
        break;

    case TIMER_CH_2:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH2);
        /* disable the TIMER compare 2 interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH2);
        break;

    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel complementary output enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_DISABLE);
    if(RESET == (TIMER_CHCTL2(timer_dev->periph) & (TIMER_CHCTL2_CH0NEN | TIMER_CHCTL2_CH1NEN | TIMER_CHCTL2_CH2NEN))) {
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_BRK);
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

    return ret_val;
}

/*!
    \brief      start TIMER complementary channel output compare mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[in]  dmacb: TIMER DMA callback function pointer struct
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[in]  mem_addr: TIMER DMA transfer memory address
    \param[in]  dma_length: TIMER DMA transfer count, 0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle = dmacb->channelx_compare_dma_full_transcom_handle;
    timer_dev->timer_dma.error_handle = dmacb->error_handle;

    switch(channel) {
    case TIMER_CH_0:
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.error_handle = _timer_dma_error;
        /* enable the DMA CH0 interrupt */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0], (uint32_t)mem_addr, TIMER_CH0CV_ADDRESS(timer_dev->periph), dma_length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
        break;

    case TIMER_CH_1:
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.error_handle = _timer_dma_error;
        /* enable the DMA CH1 interrupt */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1], (uint32_t)mem_addr, TIMER_CH1CV_ADDRESS(timer_dev->periph), dma_length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
        break;

