PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    case TIMER_CH_2:
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.error_handle = _timer_dma_error;
        /* enable the DMA CH2 interrupt */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2], (uint32_t)mem_addr, TIMER_CH2CV_ADDRESS(timer_dev->periph), dma_length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
        break;

    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);
    /* enable a TIMER */
    _timer_enable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary channel output compare mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14..16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_output_compare_complementary_channel_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(channel) {
    case TIMER_CH_0:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);
        break;

    case TIMER_CH_1:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]);
        break;

    case TIMER_CH_2:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]);
        break;

    default:
        HAL_DEBUGE("parameter [channel] value is invalid");
        return HAL_ERR_VAL;
    }

    /* configure TIMER channel complementary output enable state */
    hals_timer_channel_complementary_output_state_config(timer_dev->periph, channel, TIMER_CCXN_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      TIMER single pulse mode configure
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_singlepulse: TIMER single pulse mode channel configuration struct
                  sp_compare_mode: the argument could be selected from enumeration <hal_timer_output_compare_enum>
                  sp_oc_pulse_value:0~65535,(for TIMER1 0x00000000~0xFFFFFFFF)
                  sp_oc_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_POLARITY_HIGH : channel output polarity is high
      \arg          TIMER_OC_POLARITY_LOW : channel output polarity is low
                  sp_oc_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_IDLE_STATE_LOW : idle state of channel output is high
      \arg          TIMER_OC_IDLE_STATE_HIGH : idle state of channel output is low
                  sp_ocn_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_POLARITY_HIGH : channel complementary output polarity is high
      \arg          TIMER_OCN_POLARITY_LOW : channel complementary output polarity is low
                  sp_ocn_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_IDLE_STATE_LOW : idle state of channel complementary output is high
      \arg          TIMER_OCN_IDLE_STATE_HIGH :  idle state of channel complementary output is low
                  sp_oc_fastmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_FAST_ENABLE : channel output fast function enable
      \arg          TIMER_OC_FAST_DISABLE : channel output fast function disable
                  sp_oc_clearmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_CLEAR_ENABLE : channel output clear function enable
      \arg          TIMER_OC_CLEAR_DISABLE : channel output clear function disable
                  sp_ic_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_POLARITY_RISING : input capture rising edge
      \arg          TIMER_IC_POLARITY_FALLING : input capture falling edge
      \arg          TIMER_IC_POLARITY_BOTH_EDGE : input capture both edge
                  sp_ic_selection:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_IC_SELECTION_DIRECTTI : channel y is configured as input and icy is mapped on CIy
      \arg          TIMER_IC_SELECTION_INDIRECTTI : channel y is configured as input and icy is mapped on opposite input
      \arg          TIMER_IC_SELECTION_ITS : channel y is configured as input and icy is mapped on ITS
                  sp_ic_filter: 0~15
    \param[in]  channel_out: TIMER output channel.The channel will output single pulse
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
    \param[in]  channel_in: TIMER input channel.If the channel input a active signal,TIMER will start count.
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_mode_channel_config(hal_timer_dev_struct *timer_dev, hal_timer_single_pulse_struct *timer_singlepulse, uint16_t channel_out, uint16_t channel_in)
{
    static hal_timer_input_capture_struct input_capture;
    static hal_timer_output_compare_struct output_compare;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == timer_singlepulse) {
        HAL_DEBUGE("pointer [timer_singlepulse] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(channel_out != channel_in) {
        /* TIMER output compare mode struct config */
        output_compare.compare_mode = timer_singlepulse->sp_compare_mode;
        output_compare.oc_pulse_value = timer_singlepulse->sp_oc_pulse_value;
        output_compare.oc_polarity = timer_singlepulse->sp_oc_polarity;
        output_compare.ocn_polarity = timer_singlepulse->sp_ocn_polarity;
        output_compare.oc_idlestate = timer_singlepulse->sp_oc_idlestate;
        output_compare.ocn_idlestate = timer_singlepulse->sp_ocn_idlestate;
        output_compare.oc_shadow = TIMER_OC_SHADOW_DISABLE;
        output_compare.oc_fastmode = timer_singlepulse->sp_oc_fastmode;
        output_compare.oc_clearmode = timer_singlepulse->sp_oc_clearmode;
        switch(channel_out) {
        case TIMER_CH_0:
            /* configure TIMER output compare mode */
            hals_timer_channel_output_config(timer_dev->periph, TIMER_CH_0, &output_compare);
            break;
        case TIMER_CH_1:
            /* configure TIMER output compare mode */
            hals_timer_channel_output_config(timer_dev->periph, TIMER_CH_1, &output_compare);
            break;
        default:
            HAL_DEBUGE("parameter [channel_out] value is invalid");
            return HAL_ERR_VAL;
        }

        /* TIMER input capture mode structure config */
        input_capture.ic_polarity  = timer_singlepulse->sp_ic_polarity;
        input_capture.ic_selection = timer_singlepulse->sp_ic_selection;
        input_capture.ic_prescaler = TIMER_IC_PRESCALER_OFF;
        input_capture.ic_filter    = timer_singlepulse->sp_ic_filter;
        switch(channel_in) {
        case TIMER_CH_0:
            /* configure TIMER input capture mode */
            hals_timer_channel_input_capture_config(timer_dev->periph, TIMER_CH_0, &input_capture);
            /* select TIMER input trigger source */
            hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI0FE0);
            /* select TIMER slave mode */
            hals_timer_slave_mode_select(timer_dev->periph, TIMER_SLAVE_MODE_EVENT);
            break;
        case TIMER_CH_1:
            /* configure TIMER input capture mode */
            hals_timer_channel_input_capture_config(timer_dev->periph, TIMER_CH_1, &input_capture);
            /* select TIMER input trigger source */
            hals_timer_input_trigger_source_select(timer_dev->periph, TIMER_SMCFG_TRGSEL_CI1FE1);
            /* select TIMER slave mode */
            hals_timer_slave_mode_select(timer_dev->periph, TIMER_SLAVE_MODE_EVENT);
            break;
        default:
            HAL_DEBUGE("parameter [channel_in] value is invalid");
            return HAL_ERR_VAL;
        }
        return HAL_ERR_NONE;
    } else {
        return HAL_ERR_VAL;
    }
}

/*!
    \brief      start TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_start(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER single pulse mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_stop(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* TIMER input capture interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = p_irq->channelx_capture_handle;
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = p_irq->channelx_compare_handle;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_stop_interrupt(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* TIMER input capture interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = NULL;
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = NULL;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
    /* disable the TIMER interrupt */
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementary channel single pulse mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel_out:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_complementary_channel_start(hal_timer_dev_struct *timer_dev, uint16_t channel_out)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    switch(channel_out) {
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCXN_ENABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCXN_ENABLE);
        break;
    default:
        HAL_DEBUGE("parameter [channel_out] value is invalid");
        return HAL_ERR_VAL;
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary channel single pulse mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel_out:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_complementary_channel_stop(hal_timer_dev_struct *timer_dev, uint16_t channel_out)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    switch(channel_out) {
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCXN_DISABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCXN_DISABLE);
        break;
    default:
        HAL_DEBUGE("parameter [channel_out] value is invalid");
        return HAL_ERR_VAL;
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER complementary channel single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel_out:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
    \param[in]  p_irq: TIMER interrupt user callback function pointer struct
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_complementary_channel_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel_out, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

