PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* TIMER input capture interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = p_irq->channelx_capture_handle;
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = p_irq->channelx_compare_handle;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
    switch(channel_out) {
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCXN_ENABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCXN_ENABLE);
        break;
    default:
        HAL_DEBUGE("parameter [channel_out] value is invalid");
        return HAL_ERR_VAL;
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, ENABLE);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER complementary channel single pulse mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel_out:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,14))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_single_pulse_complementary_channel_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel_out)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* TIMER input capture interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = NULL;
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = NULL;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
    /* disable the TIMER interrupt */
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
    switch(channel_out) {
    case TIMER_CH_0:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCXN_DISABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        hals_timer_channel_complementary_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCXN_DISABLE);
        break;
    default:
        HAL_DEBUGE("parameter [channel_out] value is invalid");
        return HAL_ERR_VAL;
    }
    /* enable or disable TIMER primary output */
    _timer_primary_output_config(timer_dev, DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      configure TIMER slave mode and interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timer_slavemode: TIMER slave mode configuration structure
                  slavemode: the argument could be selected from enumeration <hal_timer_slave_mode_enum>
                  trigger_selection: the argument could be selected from enumeration <hal_timer_input_trigger_source_enum>
                  trigger_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_RISING: trigger input source is ETI, active high or rising edge active
      \arg          TIMER_CLOCK_TRIGGER_ETI_POLARITY_FALLING: trigger input source is ETI, active low or falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_RISING: trigger input source is CIx(x=0,1), rising edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_FALLING: trigger input source is CIx(x=0,1), falling edge active
      \arg          TIMER_CLOCK_TRIGGER_POLARITY_BOTH_EDGE: trigger input source is CI0F_ED, both rising and falling edge active
                  trigger_prescaler:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PRESCALER_OFF: external trigger no divided
      \arg          TIMER_EXT_TRI_PRESCALER_DIV2: external trigger divided by 2
      \arg          TIMER_EXT_TRI_PRESCALER_DIV4: external trigger divided by 4
      \arg          TIMER_EXT_TRI_PRESCALER_DIV8: external trigger divided by 8
                  trigger_filter: 0~15
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_slave_mode_interrupt_config(hal_timer_dev_struct *timer_dev, hal_timer_slave_mode_struct *timer_slavemode, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == timer_dev) || (NULL == timer_slavemode)) {
        HAL_DEBUGE("pointer [timer_dev] or [timer_slavemode] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#if defined(GD32F350)
    /* check the parameters */
    if((TIMER5 == timer_dev->periph) || (TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->slavemode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#else
    /* check the parameters */
    if((TIMER13 == timer_dev->periph) || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->slavemode] of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* GD32F350 */
    /* check the parameters */
    if((TIMER_TRIGGER_SOURCE_ETIFP == timer_slavemode->trigger_selection) && (TIMER14 == timer_dev->periph)) {
        HAL_DEBUGE("the [timer_slavemode->trigger_selection] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
    if(TIMER_TRIGGER_SOURCE_DISABLE == timer_slavemode->trigger_selection) {
        HAL_DEBUGE("the [timer_slavemode->trigger_selection] value of [timer_dev] is invalid");
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* TIMER trigger interrupt handler set */
    timer_dev->timer_irq.trigger_handle = p_irq->trigger_handle;

    switch(timer_slavemode->trigger_selection) {
    case TIMER_TRIGGER_SOURCE_ITI0:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI1:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI2:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_ITI3:
        /* no need to config polarity, prescaler, filter */
        break;
    case TIMER_TRIGGER_SOURCE_CI0FE0:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH0NEN));
        /* reset the CH0P and CH0NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        /* config polarity */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)(timer_slavemode->trigger_polarity);
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
        break;
    case TIMER_TRIGGER_SOURCE_CI1FE1:
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH1P and CH1NP bits */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
        /* config polarity */
        TIMER_CHCTL2(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_polarity) << 4U);
        /* reset the CH1CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 12U);
        break;
    case TIMER_TRIGGER_SOURCE_CI0FED:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_dev->periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH0CAPFLT bit */
        TIMER_CHCTL0(timer_dev->periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        /* config filter */
        TIMER_CHCTL0(timer_dev->periph) |= (uint32_t)((uint32_t)(timer_slavemode->trigger_filter) << 4U);
        break;
    case TIMER_TRIGGER_SOURCE_ETIFP:
        /* configure TIMER external trigger input */
        hals_timer_external_trigger_config(timer_dev->periph, timer_slavemode->trigger_prescaler,
                                           timer_slavemode->trigger_polarity, timer_slavemode->trigger_filter);
        break;
    default:
        HAL_DEBUGW("parameter [timer_slavemode->trigger_selection] value is undefine");
        return HAL_ERR_VAL;
    }

    /* select TIMER input trigger source  */
    hals_timer_input_trigger_source_select(timer_dev->periph, timer_slavemode->trigger_selection);
    /* select TIMER slave mode */
    hals_timer_slave_mode_select(timer_dev->periph, timer_slavemode->slavemode);

    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_TRG);
    /* disable the TIMER DMA trigger request */
    hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);

