PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      start TIMER decoder mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_start(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(channel) {
    case TIMER_CH_0:
        /* configure TIMER channel 0 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel 1 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_0_1:
        /* configure TIMER channel 0 and channel 1 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER decoder mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_stop(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(channel) {
    case TIMER_CH_0:
        /* configure TIMER channel 0 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_1:
        /* configure TIMER channel 1 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_0_1:
        /* configure TIMER channel 0 and channel 1 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER decoder mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_start_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);

    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = p_irq->channelx_capture_handle;
    switch(channel) {
    case TIMER_CH_0:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        /* configure TIMER channel 0 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        /* configure TIMER channel 1 enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_0_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

