PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER decoder mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_stop_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = NULL;
    switch(channel) {
    case TIMER_CH_0:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_0_1:
        /* clear the TIMER interrupt flag */
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER decoder mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[in]  dmacb: TIMER DMA callback function pointer structure
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[in]  decoder_dma: TIMER decoder mode DMA transfer configuration structure
                  mem_addr0: TIMER DMA transfer memory address for TIMER_CH_0 DMA request
                  mem_addr1: TIMER DMA transfer memory address for TIMER_CH_1 DMA request
                  length: TIMER DMA transfer count, 0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_start_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_dma_handle_cb_struct *dmacb, hal_timer_decoder_dma_config_struct *decoder_dma)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    timer_dev->timer_dma.channelx_capture_dma_full_transcom_handle = dmacb->channelx_capture_dma_full_transcom_handle;
    timer_dev->timer_dma.error_handle = dmacb->error_handle;

    switch(channel) {
    case TIMER_CH_0:
        /* channel DMA config */
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.full_finish_handle = _channelx_capture_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.error_handle = _timer_dma_error;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)decoder_dma->mem_addr0, decoder_dma->length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_1:
        /* channel DMA config */
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.full_finish_handle = _channelx_capture_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.error_handle = _timer_dma_error;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1], TIMER_CH1CV_ADDRESS(timer_dev->periph), (uint32_t)decoder_dma->mem_addr1, decoder_dma->length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    case TIMER_CH_0_1:
        /* channel0 DMA config */
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.full_finish_handle = _channelx_capture_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.error_handle = _timer_dma_error;
        /* channel1 DMA config */
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.full_finish_handle = _channelx_capture_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.error_handle = _timer_dma_error;
        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)decoder_dma->mem_addr0, decoder_dma->length, NULL);
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1], TIMER_CH1CV_ADDRESS(timer_dev->periph), (uint32_t)decoder_dma->mem_addr1, decoder_dma->length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_ENABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

