PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER decoder mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_0_1: TIMER channel0 and TIMER channel1
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_decoder_stop_dma(hal_timer_dev_struct *timer_dev, uint16_t channel)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(channel) {
    case TIMER_CH_0:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_1:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    case TIMER_CH_0_1:
        /* disbale the DMA CH0 interrupt */
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]);
        /* configure TIMER channel enable state */
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
        hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_1, TIMER_CCX_DISABLE);
        break;
    default:
        HAL_DEBUGW("parameter [channel] value is undefine");
        return HAL_ERR_VAL;
    }
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER hall sensor mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_start(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER hall sensor mode
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_stop(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER hall sensor mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_start_interrupt(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_capture_handle = p_irq->channelx_capture_handle;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER hall sensor mode and channel interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_stop_interrupt(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* TIMER output compare interrupt handler set */
    timer_dev->timer_irq.channelx_compare_handle = NULL;
    /* clear the TIMER interrupt flag */
    hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
    /* disable the TIMER interrupt */
    hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER hall sensor mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dmacb: TIMER DMA callback function pointer struct
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[in]  mem_addr: TIMER DMA transfer memory address
    \param[in]  dma_length: TIMER DMA transfer count, 0~65535
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_start_dma(hal_timer_dev_struct *timer_dev, hal_timer_dma_handle_cb_struct *dmacb, uint32_t *mem_addr, uint16_t dma_length)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    timer_dev->timer_dma.channelx_capture_dma_full_transcom_handle = dmacb->channelx_capture_dma_full_transcom_handle;
    timer_dev->timer_dma.error_handle = dmacb->error_handle;

    timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.full_finish_handle = _channelx_capture_dma_full_transfer_complete;;
    timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.half_finish_handle = NULL;
    timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.error_handle = _timer_dma_error;
    /* enable the DMA CH0 interrupt */
    hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0], TIMER_CH0CV_ADDRESS(timer_dev->periph), (uint32_t)mem_addr, dma_length, NULL);
    hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_ENABLE);
    /* enable a TIMER */
    hals_timer_enable(timer_dev->periph);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER hall sensor mode and channel DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_hall_sensor_stop_dma(hal_timer_dev_struct *timer_dev)
{
    int32_t ret_val;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    /* disbale the DMA CH0 interrupt */
    hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
    /* stop DMA transfer */
    hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);

    /* configure TIMER channel enable state */
    hals_timer_channel_output_state_config(timer_dev->periph, TIMER_CH_0, TIMER_CCX_DISABLE);
    /* disable TIMER */
    ret_val = _timer_disable(timer_dev);

    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return ret_val;
}

/*!
    \brief      start TIMER DMA transfer mode for writing data to TIMER
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dmareq: specify which DMA request
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD: update DMA, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CMTD: commutation DMA request , TIMERx(x=0,14)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[in]  dmatcfg: TIMER DMA config parameter structure
                  start_addr: the argument could be selected from enumeration <hal_timer_dma_transfer_start_address_enum>
                  mem_addr:TIMER DMA transfer memory address
                  length: the argument could be selected from enumeration <hal_timer_dma_transfer_length_enum>
    \param[in]  dmacb: TIMER DMA callback function pointer structure
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_dma_transfer_write_start(hal_timer_dev_struct *timer_dev, uint32_t dmareq, hal_timer_dma_transfer_config_struct *dmatcfg, hal_timer_dma_handle_cb_struct *dmacb)
{
    uint16_t length = 0;
    length = (uint16_t)((dmatcfg->length >> 8U) + 1);
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == dmatcfg) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(dmareq) {
    case TIMER_DMA_UPD:
        timer_dev->timer_dma.update_dma_full_transcom_handle = dmacb->update_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.full_finish_handle = _update_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_UP]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_UP], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_UPD);
        break;
    case TIMER_DMA_CH0D:
        timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle = dmacb->channelx_compare_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH0D);
        break;
    case TIMER_DMA_CH1D:
        timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle = dmacb->channelx_compare_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH1D);
        break;
    case TIMER_DMA_CH2D:
        timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle = dmacb->channelx_compare_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH2D);
        break;
    case TIMER_DMA_CH3D:
        timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle = dmacb->channelx_compare_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.full_finish_handle = _channelx_compare_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CH3], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        /* enable the TIMER DMA update request */
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CH3D);
        break;
    case TIMER_DMA_CMTD:
        timer_dev->timer_dma.commutation_dma_full_transcom_handle = dmacb->commutation_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.full_finish_handle = _commutation_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_CMT], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CMTD);
        break;
    case TIMER_DMA_TRGD:
        timer_dev->timer_dma.trigger_dma_full_transcom_handle = dmacb->trigger_dma_full_transcom_handle;
        timer_dev->timer_dma.error_handle = dmacb->error_handle;
        timer_dev->p_dma_timer[TIMER_DMA_ID_TRG]->dma_irq.full_finish_handle = _trigger_dma_full_transfer_complete;
        timer_dev->p_dma_timer[TIMER_DMA_ID_TRG]->dma_irq.half_finish_handle = NULL;
        timer_dev->p_dma_timer[TIMER_DMA_ID_TRG]->dma_irq.error_handle = _timer_dma_error;

        /* start DMA interrupt mode transfer */
        hal_dma_start_interrupt(timer_dev->p_dma_timer[TIMER_DMA_ID_TRG], (uint32_t)dmatcfg->mem_addr, TIMER_DMATB_ADDRESS(timer_dev->periph), length, NULL);
        hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_TRGD);
        break;
    default:
        HAL_DEBUGW("parameter [dmareq] value is undefine");
        return HAL_ERR_VAL;
    }
    /* configure the TIMER DMA transfer */
    hals_timer_dma_transfer_config(timer_dev->periph, dmatcfg->start_addr, dmatcfg->length);
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);

