PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      stop TIMER DMA transfer mode for read data from TIMER
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dmareq: specify which DMA request
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD: update DMA, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CMTD: commutation DMA request , TIMERx(x=0,14)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_dma_transfer_read_stop(hal_timer_dev_struct *timer_dev, uint32_t dmareq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock TIMER */
    HAL_LOCK(timer_dev);
    switch(dmareq) {
    case TIMER_DMA_UPD:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_UP]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_UPD);
        break;
    case TIMER_DMA_CH0D:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH0D);
        break;
    case TIMER_DMA_CH1D:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH1D);
        break;
    case TIMER_DMA_CH2D:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH2D);
        break;
    case TIMER_DMA_CH3D:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CH3D);
        break;
    case TIMER_DMA_CMTD:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_CMTD);
        break;
    case TIMER_DMA_TRGD:
        /* stop DMA transfer */
        hal_dma_stop(timer_dev->p_dma_timer[TIMER_DMA_ID_TRG]);
        hals_timer_dma_disable(timer_dev->periph, TIMER_DMA_TRGD);
        break;
    default:
        HAL_DEBUGW("parameter [dmareq] value is undefine");
        return HAL_ERR_VAL;
    }
    /* unlock TIMER */
    HAL_UNLOCK(timer_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER commutation event
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_commutation_event_config(hal_timer_dev_struct *timer_dev, uint32_t trigger_source, uint32_t com_source)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
            || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)) {
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    hals_timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    hals_timer_channel_control_shadow_update_config(timer_dev->periph, com_source);
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER commutation event and enable CMT interrupt
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs
    \param[in]  p_irq: TIMER interrupt user callback function pointer structure
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_commutation_event_interrupt_config(hal_timer_dev_struct *timer_dev, uint32_t trigger_source, uint32_t com_source, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* TIMER commutation interrupt handler set */
    timer_dev->timer_irq.commutation_handle = p_irq->commutation_handle;

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
            || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)) {
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    hals_timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    hals_timer_channel_control_shadow_update_config(timer_dev->periph, com_source);

    /* enable the TIMER interrupt */
    hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CMT);

