PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure TIMER commutation event and enable CMT DMA request
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trigger_source:
       \arg        TIMER_TRIGGER_SOURCE_ITI0: trigger input source selection:ITI0
       \arg        TIMER_TRIGGER_SOURCE_ITI1: trigger input source selection:ITI1
       \arg        TIMER_TRIGGER_SOURCE_ITI2: trigger input source selection:ITI2
       \arg        TIMER_TRIGGER_SOURCE_ITI3: trigger input source selection:ITI3
       \arg        TIMER_TRIGGER_SOURCE_DISABLE: trigger input source selection:none
    \param[in]  com_source:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_UPDATECTL_CCU: the shadow registers are updated when CMTG bit is set
       \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers are updated when CMTG bit is set or an rising edge of TRGI occurs
    \param[in]  dmacb: TIMER DMA callback function pointer structure
                  update_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER update DMA request
                  channelx_capture_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel input capture DMA request
                  channelx_compare_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER channel output compare DMA request
                  commutation_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER commutation DMA request
                  trigger_dma_full_transcom_handle: TIMER DMA transfer complete interrupt handler for TIMER trigger DMA request
                  error_handle: TIMER DMA transfer error interrupt handler
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_commutation_event_dma_config(hal_timer_dev_struct *timer_dev, uint32_t trigger_source, uint32_t com_source, hal_timer_dma_handle_cb_struct *dmacb)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* trigger source config */
    if((TIMER_TRIGGER_SOURCE_ITI0 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI1 == trigger_source)
            || (TIMER_TRIGGER_SOURCE_ITI2 == trigger_source) || (TIMER_TRIGGER_SOURCE_ITI3 == trigger_source)) {
        TIMER_SMCFG(timer_dev->periph) &= ~TIMER_SMCFG_TRGS;
        TIMER_SMCFG(timer_dev->periph) |= trigger_source;
    }
    /* enable channel capture/compare control shadow register */
    hals_timer_channel_control_shadow_config(timer_dev->periph, ENABLE);
    /* configure TIMER channel control shadow register update control */
    hals_timer_channel_control_shadow_update_config(timer_dev->periph, com_source);

    /* DMA config for CMT DMA request */
    timer_dev->timer_dma.commutation_dma_full_transcom_handle = dmacb->commutation_dma_full_transcom_handle;
    timer_dev->timer_dma.error_handle = dmacb->error_handle;

    timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.full_finish_handle = _commutation_dma_full_transfer_complete;
    timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.half_finish_handle = NULL;
    timer_dev->p_dma_timer[TIMER_DMA_ID_CMT]->dma_irq.error_handle = _timer_dma_error;

    /* enable the TIMER DMA update request */
    hals_timer_dma_enable(timer_dev->periph, TIMER_DMA_CMTD);

    return HAL_ERR_NONE;
}

/*!
    \brief      set user-defined interrupt callback function
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to TIMER interrupt callback functions structure
                  please refer to hal_timer_irq_struct
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_irq_handle_set(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == p_irq) {
        HAL_DEBUGE("pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* TIMER update interrupt call */
    if(NULL != p_irq->update_handle) {
        timer_dev->timer_irq.update_handle = p_irq->update_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_UP);
    } else {
        timer_dev->timer_irq.update_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_UP);
    }

    /* channel interrupt for input capture */
    if(NULL != p_irq->channelx_capture_handle) {
        timer_dev->timer_irq.channelx_capture_handle = p_irq->channelx_capture_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH2);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH3);
    } else {
        timer_dev->timer_irq.channelx_capture_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH2);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH3);
    }

    /* channel interrupt for compare output */
    if(NULL != p_irq->channelx_compare_handle) {
        timer_dev->timer_irq.channelx_compare_handle = p_irq->channelx_compare_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH1);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH2);
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CH3);
    } else {
        timer_dev->timer_irq.channelx_compare_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH0);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH1);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH2);
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CH3);
    }

