PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* TIMER commutation interrupt call */
    if(NULL != p_irq->commutation_handle) {
        timer_dev->timer_irq.commutation_handle = p_irq->commutation_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_CMT);
    } else {
        timer_dev->timer_irq.commutation_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_CMT);
    }

    /* TIMER trigger interrupt call */
    if(NULL != p_irq->trigger_handle) {
        timer_dev->timer_irq.trigger_handle = p_irq->trigger_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_TRG);
    } else {
        timer_dev->timer_irq.trigger_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_TRG);
    }

    /* TIMER break interrupt handler set */
    if(NULL != p_irq->break_handle) {
        timer_dev->timer_irq.break_handle = p_irq->break_handle;
        /* enable the TIMER interrupt */
        hals_timer_interrupt_enable(timer_dev->periph, TIMER_INT_BRK);
    } else {
        timer_dev->timer_irq.break_handle = NULL;
        /* disable the TIMER interrupt */
        hals_timer_interrupt_disable(timer_dev->periph, TIMER_INT_BRK);
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      reset all user-defined interrupt callback function
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_timer_irq_handle_all_reset(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* TIMER interrupt handler reset */
    timer_dev->timer_irq.update_handle = NULL;
    timer_dev->timer_irq.channelx_capture_handle = NULL;
    timer_dev->timer_irq.channelx_compare_handle = NULL;
    timer_dev->timer_irq.commutation_handle = NULL;
    timer_dev->timer_irq.trigger_handle = NULL;
    timer_dev->timer_irq.break_handle = NULL;

    return HAL_ERR_NONE;
}

/*!
    \brief      TIMER interrupt handler content function,which is merely used in timer_handler
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_timer_irq(hal_timer_dev_struct *timer_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == timer_dev) {
        HAL_DEBUGE("pointer [timer_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* check whether the update interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_UP))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_UP);
        /* update interrupt handle */
        if(NULL != (timer_dev->timer_irq.update_handle)) {
            timer_dev->timer_irq.update_handle(timer_dev);
        }
    }

    /* check whether the channel 0 capture/compare interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH0))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH0);
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_0;
        /* channel 0 capture interrupt handle */
        if(0 != (TIMER_CHCTL0(timer_dev->periph) & TIMER_CHCTL0_CH0MS)) {
            if(NULL != (timer_dev->timer_irq.channelx_capture_handle)) {
                timer_dev->timer_irq.channelx_capture_handle(timer_dev);
            }
        } else {
            /* channel 0 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_handle)) {
                timer_dev->timer_irq.channelx_compare_handle(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
    }
    /* check whether the channel 1 capture/compare interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH1))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH1);
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_1;
        /* channel 1 capture interrupt handle */
        if(0 != (TIMER_CHCTL0(timer_dev->periph) & TIMER_CHCTL0_CH1MS)) {
            if(NULL != (timer_dev->timer_irq.channelx_capture_handle)) {
                timer_dev->timer_irq.channelx_capture_handle(timer_dev);
            }
        } else {
            /* channel 1 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_handle)) {
                timer_dev->timer_irq.channelx_compare_handle(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
    }

    /* check whether the channel 2 capture/compare interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH2))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH2);
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_2;
        /* channel 2 capture interrupt handle */
        if(0 != (TIMER_CHCTL1(timer_dev->periph) & TIMER_CHCTL1_CH2MS)) {
            if(NULL != (timer_dev->timer_irq.channelx_capture_handle)) {
                timer_dev->timer_irq.channelx_capture_handle(timer_dev);
            }
        } else {
            /* channel 2 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_handle)) {
                timer_dev->timer_irq.channelx_compare_handle(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
    }

    /* check whether the channel 3 capture/compare interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CH3))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CH3);
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_3;
        /* channel 3 capture interrupt handle */
        if(0 != (TIMER_CHCTL1(timer_dev->periph) & TIMER_CHCTL1_CH3MS)) {
            if(NULL != (timer_dev->timer_irq.channelx_capture_handle)) {
                timer_dev->timer_irq.channelx_capture_handle(timer_dev);
            }
        } else {
            /* channel 3 compare interrupt handle */
            if(NULL != (timer_dev->timer_irq.channelx_compare_handle)) {
                timer_dev->timer_irq.channelx_compare_handle(timer_dev);
            }
        }
        /* clear service channel */
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
    }
    /* check whether the commutation interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_CMT))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_CMT);
        /* commutation interrupt handle */
        if(NULL != (timer_dev->timer_irq.commutation_handle)) {
            timer_dev->timer_irq.commutation_handle(timer_dev);
        }
    }
    /* check whether the trigger interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_TRG))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_TRG);
        /* trigger interrupt handle */
        if(NULL != (timer_dev->timer_irq.trigger_handle)) {
            timer_dev->timer_irq.trigger_handle(timer_dev);
        }
    }
    /* check whether the break interrupt is set or not */
    if(SET == (hals_timer_interrupt_flag_get(timer_dev->periph, TIMER_INT_FLAG_BRK))) {
        hals_timer_interrupt_flag_clear(timer_dev->periph, TIMER_INT_FLAG_BRK);
        /* break interrupt handle */
        if(NULL != (timer_dev->timer_irq.break_handle)) {
            timer_dev->timer_irq.break_handle(timer_dev);
        }
    }
}

/*!
    \brief      enable a TIMER
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      disable a TIMER
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      enable the update event
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_update_event_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_UPDIS;
}

/*!
    \brief      disable the update event
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_update_event_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
}

/*!
    \brief      configure TIMER update source
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  update:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void hals_timer_update_source_config(uint32_t timer_periph, uint8_t update)
{
    if(TIMER_UPDATE_SRC_REGULAR == update) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPS;
    } else if(TIMER_UPDATE_SRC_GLOBAL == update) {
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_UPS;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      set TIMER counter up direction
    \param[in]  timer_periph: TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_counter_up_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      set TIMER counter down direction
    \param[in]  timer_periph: TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_counter_down_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      set TIMER counter alignment mode
    \param[in]  timer_periph: TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
    \param[in]  aligned:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void hals_timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_CAM;
    TIMER_CTL0(timer_periph) |= (uint32_t)aligned;
}

/*!
    \brief      enable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      configure TIMER counter register value
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  counter: the counter value
    \param[out] none
    \retval     none
*/
void hals_timer_counter_value_config(uint32_t timer_periph, uint32_t counter)
{
    TIMER_CNT(timer_periph) = (uint32_t)counter;
}

/*!
    \brief      read TIMER counter value
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     counter value
*/
uint32_t hals_timer_counter_read(uint32_t timer_periph)
{
    uint32_t count_value = 0U;
    count_value = TIMER_CNT(timer_periph);
    return (count_value);
}

/*!
    \brief      configure TIMER prescaler
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  prescaler: prescaler value
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void hals_timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint8_t pscreload)
{
    TIMER_PSC(timer_periph) = (uint32_t)prescaler;

    if(TIMER_PSC_RELOAD_NOW == pscreload) {
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      read TIMER prescaler value
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[out] none
    \retval     prescaler register value
*/
uint16_t hals_timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
    prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    return (prescaler_value);
}

/*!
    \brief      configure TIMER autoreload register value
    \param[in]  timer_periph: TIMERx(x=0,2,13..16),TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  autoreload: the counter auto-reload value
    \param[out] none
    \retval     none
*/
void hals_timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload)
{
    TIMER_CAR(timer_periph) = (uint32_t)autoreload;
}

/*!
    \brief      configure TIMER repetition register value
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[in]  repetition: the counter repetition value,0~255
    \param[out] none
    \retval     none
*/
void hals_timer_repetition_value_config(uint32_t timer_periph, uint16_t repetition)
{
    TIMER_CREP(timer_periph) = (uint32_t)repetition;
}

/*!
    \brief      enable or disable channel capture/compare control shadow register
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void hals_timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    } else {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs
    \param[out] none
    \retval     none
*/
void hals_timer_channel_control_shadow_update_config(uint32_t timer_periph, uint8_t ccuctl)
{
    if(TIMER_UPDATECTL_CCU == ccuctl) {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
    } else if(TIMER_UPDATECTL_CCUTRI == ccuctl) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCUC;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      select TIMER master mode output trigger source
    \param[in]  timer_periph: TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
    \param[in]  outrigger: the argument could be selected from enumeration <hal_timer_trgo_selection_enum>
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output(TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350)
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output(TIMERx(x=0,2,14),, TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350)
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output(TIMERx(x=0,2,14),, TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350)
      \arg        TIMER_TRI_OUT_SRC_CH0: a capture or a compare match occurred in channal0 as trigger output TRGO(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_TRI_OUT_SRC_O0CPRE: O0CPRE as trigger output(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_TRI_OUT_SRC_O1CPRE: O1CPRE as trigger output(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_TRI_OUT_SRC_O2CPRE: O2CPRE as trigger output(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_TRI_OUT_SRC_O3CPRE: O3CPRE as trigger output(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_master_output_trigger_source_select(uint32_t timer_periph, hal_timer_trgo_selection_enum outrigger)
{
    TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_MMC);
    TIMER_CTL1(timer_periph) |= (uint32_t)outrigger;
}

/*!
    \brief      configure TIMER master slave mode
    \param[in]  timer_periph: TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[in]  master_slave:
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: master slave mode enable
      \arg        DISABLE: master slave mode disable
    \param[out] none
    \retval     none
*/
void hals_timer_master_slave_mode_config(uint32_t timer_periph, uint32_t master_slave)
{
    if(ENABLE == master_slave) {
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_MSM;
    } else if(DISABLE == master_slave) {
        TIMER_SMCFG(timer_periph) &= ~(uint32_t)TIMER_SMCFG_MSM;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      select TIMER input trigger source
    \param[in]  timer_periph: TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[in]  intrigger:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered TIMER input 0(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered TIMER input 1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: external trigger(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_TRGS);
    TIMER_SMCFG(timer_periph) |= (uint32_t)intrigger;
}

/*!
    \brief      select TIMER slave mode
    \param[in]  timer_periph: TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[in]  slavemode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_QUAD_DECODER_MODE0: encoder mode 0(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_QUAD_DECODER_MODE1: encoder mode 1(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_QUAD_DECODER_MODE2: encoder mode 2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SLAVE_MODE_EVENT: event mode(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_SMC);
    TIMER_SMCFG(timer_periph) |= (uint32_t)slavemode;
}

/*!
    \brief      configure TIMER external trigger input
    \param[in]  timer_periph: TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
    \param[in]  extprescaler:
                only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_PRESCALER_OFF : no divided
      \arg          TIMER_EXT_TRI_PRESCALER_DIV2 : divided by 2
      \arg          TIMER_EXT_TRI_PRESCALER_DIV4 : divided by 4
      \arg          TIMER_EXT_TRI_PRESCALER_DIV8 : divided by 8
    \param[in]  extpolarity:
                only one parameter can be selected which is shown as below:
      \arg          TIMER_EXT_TRI_POLARITY_RISING : active high or rising edge active
      \arg          TIMER_EXT_TRI_POLARITY_FALLING : active low or falling edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void hals_timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
    TIMER_SMCFG(timer_periph) &= (~(uint32_t)(TIMER_SMCFG_ETP | TIMER_SMCFG_ETPSC | TIMER_SMCFG_ETFC | TIMER_SMCFG_SMC1));
    TIMER_SMCFG(timer_periph) |= (uint32_t)(extprescaler | extpolarity);
    TIMER_SMCFG(timer_periph) |= (uint32_t)(extfilter << 8U);
}

