PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
/*!
    \brief      get TIMER flags
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0,2,5,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_FLAG_CH0: channel 0 flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH1: channel 1 flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH2: channel 2 flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH3: channel 3 flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_BRK: break flag,TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350,
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350,
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    if(RESET != (TIMER_INTF(timer_periph) & flag)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear TIMER flags
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_FLAG_CH0: channel 0 flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH1: channel 1 flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH2: channel 2 flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH3: channel 3 flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_BRK: break flag,TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)flag);
}

/*!
    \brief      enable the TIMER interrupt
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt disable, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_INT_CH0: channel 0 interrupt disable, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH1: channel 1 interrupt disable, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH2: channel 2 interrupt disable, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH3: channel 3 interrupt disable , TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CMT: commutation interrupt disable, TIMERx(x=0,14..16)
      \arg        TIMER_INT_TRG: trigger interrupt disable, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_BRK: break interrupt disable, TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) interrupt;
}

/*!
    \brief      disable the TIMER interrupt
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt source disable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt disable, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_INT_CH0: channel 0 interrupt disable, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH1: channel 1 interrupt disable, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH2: channel 2 interrupt disable, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CH3: channel 3 interrupt disable , TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_CMT: commutation interrupt disable, TIMERx(x=0,14..16)
      \arg        TIMER_INT_TRG: trigger interrupt disable, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_BRK: break interrupt disable, TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)interrupt);
}

/*!
    \brief      get timer interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,14..16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_BRK:  break interrupt flag, TIMERx(x=0,14..16)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_timer_interrupt_flag_get(uint32_t timer_periph, uint32_t interrupt)
{
    uint32_t val;
    val = (TIMER_DMAINTEN(timer_periph) & interrupt);
    if((RESET != (TIMER_INTF(timer_periph) & interrupt)) && (RESET != val)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear TIMER interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,14..16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_INT_FLAG_BRK:  break interrupt flag, TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)interrupt);
}

/*!
    \brief      enable the TIMER DMA
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to enable
                one or more parameters can be selected which is shown as below:
      \arg        TIMER_DMA_UPD: update DMA, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CMTD: commutation DMA request , TIMERx(x=0,14)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_dma_enable(uint32_t timer_periph, uint16_t dma)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) dma;
}

/*!
    \brief      disable the TIMER DMA
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to disable
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD: update DMA, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_DMA_CMTD: commutation DMA request , TIMERx(x=0,14)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     none
*/
void hals_timer_dma_disable(uint32_t timer_periph, uint16_t dma)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma));
}

/*!
    \brief      channel DMA request source selection
    \param[in]  timer_periph: TIMERx(x=0,2,14..16), TIMER1 just for GD32F330 and GD32F350
    \param[in]  dma_request: channel DMA request source selection
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMAREQUEST_CHANNELEVENT: DMA request of channel y is sent when channel y event occurs
       \arg        TIMER_DMAREQUEST_UPDATEEVENT: DMA request of channel y is sent when update event occurs
    \param[out] none
    \retval     none
*/
void hals_timer_channel_dma_request_source_select(uint32_t timer_periph, uint8_t dma_request)
{
    if(TIMER_DMAREQUEST_UPDATEEVENT == dma_request) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_DMAS;
    } else if(TIMER_DMAREQUEST_CHANNELEVENT == dma_request) {
        TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_DMAS;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure the TIMER DMA transfer
    \param[in]  timer_periph: TIMERx(x=0..2,14..16)
    \param[in]  dma_startaddr: the argument could be selected from enumeration <hal_timer_dma_transfer_start_address_enum>
    \param[in]  dma_lenth: the argument could be selected from enumeration <hal_timer_dma_transfer_length_enum>
    \param[out] none
    \retval     none
*/
void hals_timer_dma_transfer_config(uint32_t timer_periph, hal_timer_dma_transfer_start_address_enum dma_baseaddr, hal_timer_dma_transfer_length_enum dma_lenth)
{
    TIMER_DMACFG(timer_periph) &= (~(uint32_t)(TIMER_DMACFG_DMATA | TIMER_DMACFG_DMATC));
    TIMER_DMACFG(timer_periph) |= (uint32_t)(dma_baseaddr | dma_lenth);
}

/*!
    \brief      software generate events
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  event: the timer software event generation sources
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_EVENT_SRC_UPG: update event,TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350, TIMER5 just for GD32F350
      \arg        TIMER_EVENT_SRC_CH0G: channel 0 capture or compare event generation, TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_EVENT_SRC_CH1G: channel 1 capture or compare event generation, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_EVENT_SRC_CH2G: channel 2 capture or compare event generation, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_EVENT_SRC_CH3G: channel 3 capture or compare event generation, TIMERx(x=0,2), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_EVENT_SRC_CMTG: channel commutation event generation, TIMERx(x=0,14..16)
      \arg        TIMER_EVENT_SRC_TRGG: trigger event generation, TIMERx(x=0,2,14), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_EVENT_SRC_BRKG: break event generation, TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_event_software_generate(uint32_t timer_periph, uint16_t event)
{
    TIMER_SWEVG(timer_periph) |= (uint32_t)event;
}

/*!
    \brief      configure TIMER channel output compare
    \param[in]  timer_periph: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,2,13..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[in]  timer_outputcompare: TIMER output compare configuration structure
                  compare_mode: the argument could be selected from enumeration <hal_timer_output_compare_enum>
                  oc_pulse_value:0~65535,(for TIMER1 0x00000000~0xFFFFFFFF)
                  oc_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_POLARITY_HIGH : channel output polarity is high
      \arg          TIMER_OC_POLARITY_LOW : channel output polarity is low
                  oc_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_IDLE_STATE_LOW : idle state of channel output is high
      \arg          TIMER_OC_IDLE_STATE_HIGH : idle state of channel output is low
                  ocn_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_POLARITY_HIGH : channel complementary output polarity is high
      \arg          TIMER_OCN_POLARITY_LOW : channel complementary output polarity is low
                  ocn_idlestate:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OCN_IDLE_STATE_LOW : idle state of channel complementary output is high
      \arg          TIMER_OCN_IDLE_STATE_HIGH :  idle state of channel complementary output is low
                  oc_shadow:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_SHADOW_ENABLE : channel output compare shadow enable
      \arg          TIMER_OC_SHADOW_DISABLE : channel output compare shadow disable
                  oc_fastmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_FAST_ENABLE : channel output fast function enable
      \arg          TIMER_OC_FAST_DISABLE : channel output fast function disable
                  oc_clearmode:
                  only one parameter can be selected which is shown as below:
      \arg          TIMER_OC_CLEAR_ENABLE : channel output clear function enable
      \arg          TIMER_OC_CLEAR_DISABLE : channel output clear function disable
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
void hals_timer_channel_output_config(uint32_t timer_periph, uint16_t channel, hal_timer_output_compare_struct *timer_outputcompare)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        /* reset the CH0EN CH0NEN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH0NEN));
        /* reset the CH0MS bit */
        TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
        /* configure TIMER_CH_0 complementary channel */
        /* reset the CH0NP bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0NP);
        /* set the CH0NP bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)timer_outputcompare->ocn_polarity;
        /* configure TIMER_CH_0 channel idel state */
        if((TIMER0 == timer_periph) || (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
            /* reset the ISO0 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
            /* set the ISO0 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)timer_outputcompare->oc_idlestate;
            /* reset the ISO0N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
            /* set the ISO0N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)timer_outputcompare->ocn_idlestate;
        }

        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* reset the CH1EN CH1NEN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH1MS bit */
        TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH1MS;

#if (defined(GD32F350) || defined(GD32F330))
        /* configure TIMER_CH_1 complementary channel polarity */
        if((TIMER0 == timer_periph) || (TIMER1 == timer_periph) || (TIMER2 == timer_periph) || (TIMER14 == timer_periph)) {
#else
        /* configure TIMER_CH_1 complementary channel polarity */
        if((TIMER0 == timer_periph) || (TIMER2 == timer_periph) || (TIMER14 == timer_periph)) {
#endif
            /* reset the CH1NP bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1NP);
            /* set the CH1NP bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(timer_outputcompare->ocn_polarity << 4U);
        }
        /* configure TIMER_CH_1 channel idel state */
        if((TIMER0 == timer_periph) || (TIMER14 == timer_periph)) {
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(timer_outputcompare->oc_idlestate << 2U);
            /* reset the ISO1N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
            /* set the ISO1N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(timer_outputcompare->ocn_idlestate << 2U);
        }
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        /* reset the CH2EN CH2NEN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2EN | TIMER_CHCTL2_CH2NEN));
        /* reset the CH2MS bit */
        TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH2MS;

#if (defined(GD32F350) || defined(GD32F330))
        /* configure TIMER_CH_2 complementary channel */
        if((TIMER0 == timer_periph) || (TIMER1 == timer_periph) || (TIMER2 == timer_periph)) {
#else
        /* configure TIMER_CH_2 complementary channel */
        if((TIMER0 == timer_periph) || (TIMER2 == timer_periph)) {
#endif
            /* reset the CH2NP bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NP);
            /* set the CH2NP bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(timer_outputcompare->ocn_polarity << 8U);
        }
        /* configure TIMER_CH_2 channel idel state */
        if(TIMER0 == timer_periph) {
            /* reset the ISO2 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
            /* set the ISO2 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(timer_outputcompare->oc_idlestate << 4U);
            /* reset the ISO2N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
            /* set the ISO2N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(timer_outputcompare->ocn_idlestate << 4U);
        }
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        /* reset the CH3EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
        /* reset the CH3MS bit */
        TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH3MS;

