PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_timer.c
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* reset the CH1EN CH1NEN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1EN | TIMER_CHCTL2_CH1NEN));
        /* reset the CH1P and CH1NP bits */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
        TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_polarity) << 4U);
        /* reset the CH1MS bit */
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_selection) << 8U);
        /* reset the CH1CAPPSC bit */
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPPSC);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)(timer_inputcapture->ic_prescaler) << 8U);
        /* reset the CH1CAPFLT bit */
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_filter) << 12U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        /* reset the CH2EN CH2NEN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2EN | TIMER_CHCTL2_CH2NEN));
        /* reset the CH2P and CH2NP bits */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2P | TIMER_CHCTL2_CH2NP));
        TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_polarity) << 8U);
        /* reset the CH2MS bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_selection));
        /* reset the CH2CAPPSC bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPPSC);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(timer_inputcapture->ic_prescaler);
        /* reset the CH2CAPFLT bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPFLT);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_filter) << 4U);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        /* reset the CH3EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
        /* reset the CH3P and CH3NP bits */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH3P | TIMER_CHCTL2_CH3NP));
        TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_polarity) << 12U);
        /* reset the CH3MS bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_selection) << 8U);
        /* reset the CH3CAPPSC bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPPSC);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)(timer_inputcapture->ic_prescaler) << 8U);
        /* reset the CH3CAPFLT bit */
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPFLT);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)(timer_inputcapture->ic_filter) << 12U);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel input capture prescaler value
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[in]  prescaler: channel input capture prescaler value
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_PRESCALER_OFF: no prescaler
      \arg        TIMER_IC_PRESCALER_DIV2: divided by 2
      \arg        TIMER_IC_PRESCALER_DIV4: divided by 4
      \arg        TIMER_IC_PRESCALER_DIV8: divided by 8
    \param[out] none
    \retval     none
*/
void hals_timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPPSC);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)prescaler;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPPSC);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)prescaler << 8U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPPSC);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)prescaler;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPPSC);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)prescaler << 8U);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel capture/compare register value
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13..16)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2,14)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2)), TIMER1 just for GD32F330 and GD32F350
    \param[out] none
    \retval     channel capture compare register value
*/
uint32_t hals_timer_input_capture_register_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t ret_val;

    switch(channel) {
    /* read TIMER channel 0 capture compare register value */
    case TIMER_CH_0:
        ret_val = TIMER_CH0CV(timer_periph);
        break;
    /* read TIMER channel 1 capture compare register value */
    case TIMER_CH_1:
        ret_val = TIMER_CH1CV(timer_periph);
        break;
    /* read TIMER channel 2 capture compare register value */
    case TIMER_CH_2:
        ret_val = TIMER_CH2CV(timer_periph);
        break;
    /* read TIMER channel 3 capture compare register value */
    case TIMER_CH_3:
        ret_val = TIMER_CH3CV(timer_periph);
        break;
    default:
        break;
    }
    return (ret_val);
}

/*!
    \brief      enable TIMER break function
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_break_enable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRKEN;
}

/*!
    \brief      disable TIMER break function
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_break_disable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_BRKEN;
}

/*!
    \brief      enable TIMER output automatic function
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_automatic_output_enable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_OAEN;
}

/*!
    \brief      disable TIMER output automatic function
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void hals_timer_automatic_output_disable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_OAEN;
}

/*!
    \brief      configure TIMER channel remap function
    \param[in]  timer_periph: TIMERx(x=13)
    \param[in]  remap:
                only one parameter can be selected which is shown as below:
      \arg        TIMER13_CI0_RMP_GPIO: timer13 channel 0 input is connected to GPIO(TIMER13_CH0)
      \arg        TIMER13_CI0_RMP_RTCCLK: timer13 channel 0 input is connected to the RTCCLK
      \arg        TIMER13_CI0_RMP_HXTAL_DIV32: timer13 channel 0 input is connected to HXTAL/32 clock
      \arg        TIMER13_CI0_RMP_CKOUTSEL: timer13 channel 0 input is connected to CKOUTSEL
    \param[out] none
    \retval     none
*/
void hals_timer_channel_remap_config(uint32_t timer_periph, uint32_t remap)
{
    TIMER_IRMP(timer_periph) = (uint32_t)remap;
}

/*!
    \brief      configure TIMER write CHxVAL register selection
    \param[in]  timer_periph: TIMERx(x=0,2,13..16), TIMER1 just for GD32F330 and GD32F350
    \param[in]  ccsel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHVSEL_DISABLE: no effect
      \arg        TIMER_CHVSEL_ENABLE:  when write the CHxVAL register, if the write value is same as the CHxVAL value, the write access is ignored
    \param[out] none
    \retval     none
*/
void hals_timer_write_chxval_register_config(uint32_t timer_periph, uint16_t chvsel)
{
    if(TIMER_CHVSEL_ENABLE == chvsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CHVSEL;
    } else if(TIMER_CHVSEL_DISABLE == chvsel) {
        TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_CHVSEL;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER output value selection
    \param[in]  timer_periph: TIMERx(x=0,14..16)
    \param[in]  outsel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OUTSEL_DISABLE: no effect
      \arg        TIMER_OUTSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void hals_timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel)
{
    if(TIMER_OUTSEL_ENABLE == outsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_OUTSEL;
    } else if(TIMER_OUTSEL_DISABLE == outsel) {
        TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_OUTSEL;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER channel input capture DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _update_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);

    /* call DMA transmission complete(TC) handle for TIMER input capture DMA request */
    if(NULL != (timer_dev->timer_dma.update_dma_full_transcom_handle)) {
        timer_dev->timer_dma.update_dma_full_transcom_handle(timer_dev);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER channel input capture DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _channelx_capture_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);
    /* service channel assignment */
    if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_0;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_1;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_2;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_3;
    }
    /* call DMA transmission complete(TC) handle for TIMER input capture DMA request */
    if(NULL != (timer_dev->timer_dma.channelx_capture_dma_full_transcom_handle)) {
        timer_dev->timer_dma.channelx_capture_dma_full_transcom_handle(timer_dev);
    }
    timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER channel input capture DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _channelx_compare_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);
    /* service channel assignment */
    if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH0]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_0;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH1]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_1;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH2]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_2;
    } else if(dma == timer_dev->p_dma_timer[TIMER_DMA_ID_CH3]) {
        timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_3;
    }
    /* call DMA transmission complete(TC) handle for TIMER input capture DMA request */
    if(NULL != (timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle)) {
        timer_dev->timer_dma.channelx_compare_dma_full_transcom_handle(timer_dev);
    }
    timer_dev->service_channel = HAL_TIMER_SERVICE_CHANNEL_NONE;
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER channel input capture DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _commutation_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER input capture DMA request */
    if(NULL != (timer_dev->timer_dma.commutation_dma_full_transcom_handle)) {
        timer_dev->timer_dma.commutation_dma_full_transcom_handle(timer_dev);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER commutation DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _trigger_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER commutation DMA request */
    if(NULL != (timer_dev->timer_dma.trigger_dma_full_transcom_handle)) {
        timer_dev->timer_dma.trigger_dma_full_transcom_handle(timer_dev);
    }
}

/*!
    \brief      DMA transmission complete(TC) callback for TIMER trigger DMA request
    \param[in]  dma: DMA device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _timer_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_timer_dev_struct *timer_dev;
    /* parameter assignment */
    p_dma = (hal_dma_dev_struct *)dma;
    timer_dev = (hal_timer_dev_struct *)(p_dma->p_periph);
    /* call DMA transmission complete(TC) handle for TIMER trigger DMA request */
    if(NULL != (timer_dev->timer_dma.error_handle)) {
        timer_dev->timer_dma.error_handle(timer_dev);
    }
}

/*!
    \brief      enable TIMER
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _timer_enable(hal_timer_dev_struct *timer_dev)
{
#if (defined(GD32F350) || defined(GD32F330))
    /* check the parameters */
    if((TIMER0 == timer_dev->periph) || (TIMER1 == timer_dev->periph) || (TIMER2 == timer_dev->periph) || (TIMER14 == timer_dev->periph)) {
        if(TIMER_SLAVE_MODE_EVENT != (uint32_t)(TIMER_SMCFG(timer_dev->periph) & TIMER_SMCFG_SMC)) {
            /* enable a TIMER */
            TIMER_CTL0(timer_dev->periph) |= (uint32_t)TIMER_CTL0_CEN;
        }
    } else {
        /* enable a TIMER */
        TIMER_CTL0(timer_dev->periph) |= (uint32_t)TIMER_CTL0_CEN;
    }
#else
    /* check the parameters */
    if((TIMER0 == timer_dev->periph) || (TIMER2 == timer_dev->periph) || (TIMER14 == timer_dev->periph)) {
        if(TIMER_SLAVE_MODE_EVENT != (uint32_t)(TIMER_SMCFG(timer_dev->periph) & TIMER_SMCFG_SMC)) {
            /* enable a TIMER */
            TIMER_CTL0(timer_dev->periph) |= (uint32_t)TIMER_CTL0_CEN;
        }
    } else {
        /* enable a TIMER */
        TIMER_CTL0(timer_dev->periph) |= (uint32_t)TIMER_CTL0_CEN;
    }
#endif /* GD32F350 */
}

/*!
    \brief      disable TIMER
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE HAL_ERR_NO_SUPPORT, details refer to gd32f3x0_hal.h
*/
static int32_t _timer_disable(hal_timer_dev_struct *timer_dev)
{
    uint32_t chctl2;
    chctl2 = TIMER_CHCTL2(timer_dev->periph);
    /* determine whether channel is disabled */
    if(0 == (chctl2 & TIMER_CHX_EN_MASK)) {
        if(0 == (chctl2 & TIMER_CHNX_EN_MASK)) {
            /* complementary channel is disabled */
            hals_timer_disable(timer_dev->periph);
            return HAL_ERR_NONE;
        } else {
            /* complementary channel is not disabled */
            return HAL_ERR_NO_SUPPORT;
        }
    } else {
        /* channel is not disabled */
        return HAL_ERR_NO_SUPPORT;
    }
}

/*!
    \brief      enable or disable TIMER primary output
    \param[in]  timer_dev: TIMER device information structure
                  the structure is not necessary to be reconfigured after structure initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  state: EBANLE, DISABLE
    \param[out] none
    \retval     none
*/
static void _timer_primary_output_config(hal_timer_dev_struct *timer_dev, ControlStatus state)
{
    uint32_t chctl2;
    chctl2 = TIMER_CHCTL2(timer_dev->periph);
    /* TIMER which has primary output enable(POE) bit */
    if((TIMER0 == timer_dev->periph) || (TIMER14 == timer_dev->periph)
            || (TIMER15 == timer_dev->periph) || (TIMER16 == timer_dev->periph)) {
        if(ENABLE == state) {
            /* enable TIMER primary output */
            TIMER_CCHP(timer_dev->periph) |= (uint32_t)TIMER_CCHP_POEN;
        } else {
            /* disable TIMER primary output */
            if(0 == (chctl2 & TIMER_CHX_EN_MASK)) {
                if(0 == (chctl2 & TIMER_CHNX_EN_MASK)) {
                    TIMER_CCHP(timer_dev->periph) &= (~(uint32_t)TIMER_CCHP_POEN);
                }
            }
        }
    }
}
